/* automatically generated by rust-bindgen 0.72.1 */

pub const RMW_RET_OK: u32 = 0;
pub const RMW_RET_ERROR: u32 = 1;
pub const RMW_RET_TIMEOUT: u32 = 2;
pub const RMW_RET_UNSUPPORTED: u32 = 3;
pub const RMW_RET_BAD_ALLOC: u32 = 10;
pub const RMW_RET_INVALID_ARGUMENT: u32 = 11;
pub const RMW_RET_INCORRECT_RMW_IMPLEMENTATION: u32 = 12;
pub const RMW_RET_NODE_NAME_NON_EXISTENT: u32 = 203;
pub const RMW_DISCOVERY_OPTIONS_STATIC_PEERS_MAX_LENGTH: u32 = 256;
pub const RMW_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RMW_GID_STORAGE_SIZE: u32 = 16;
pub const RMW_QOS_POLICY_LIVELINESS_MANUAL_BY_NODE_DEPRECATED_MSG : & [u8 ; 145] = b"RMW_QOS_POLICY_LIVELINESS_MANUAL_BY_NODE is deprecated. Use RMW_QOS_POLICY_LIVELINESS_MANUAL_BY_TOPIC if manually asserted liveliness is needed.\0" ;
pub const RCL_RET_OK: u32 = 0;
pub const RCL_RET_ERROR: u32 = 1;
pub const RCL_RET_TIMEOUT: u32 = 2;
pub const RCL_RET_BAD_ALLOC: u32 = 10;
pub const RCL_RET_INVALID_ARGUMENT: u32 = 11;
pub const RCL_RET_UNSUPPORTED: u32 = 3;
pub const RCL_RET_ALREADY_INIT: u32 = 100;
pub const RCL_RET_NOT_INIT: u32 = 101;
pub const RCL_RET_MISMATCHED_RMW_ID: u32 = 102;
pub const RCL_RET_TOPIC_NAME_INVALID: u32 = 103;
pub const RCL_RET_SERVICE_NAME_INVALID: u32 = 104;
pub const RCL_RET_UNKNOWN_SUBSTITUTION: u32 = 105;
pub const RCL_RET_ALREADY_SHUTDOWN: u32 = 106;
pub const RCL_RET_NOT_FOUND: u32 = 107;
pub const RCL_RET_NODE_INVALID: u32 = 200;
pub const RCL_RET_NODE_INVALID_NAME: u32 = 201;

pub const RCL_RET_SERVICE_TAKE_FAILED: u32 = 601;
pub const RCL_RET_TIMER_INVALID: u32 = 800;
pub const RCL_RET_TIMER_CANCELED: u32 = 801;
pub const RCL_RET_WAIT_SET_INVALID: u32 = 900;
pub const RCL_RET_WAIT_SET_EMPTY: u32 = 901;
pub const RCL_RET_WAIT_SET_FULL: u32 = 902;
pub const RCL_RET_INVALID_REMAP_RULE: u32 = 1001;
pub const RCL_RET_WRONG_LEXEME: u32 = 1002;
pub const RCL_RET_INVALID_ROS_ARGS: u32 = 1003;
pub const RCL_RET_INVALID_PARAM_RULE: u32 = 1010;
pub const RCL_RET_INVALID_LOG_LEVEL_RULE: u32 = 1020;
pub const RCL_RET_EVENT_INVALID: u32 = 2000;
pub const RCL_RET_EVENT_TAKE_FAILED: u32 = 2001;
pub const RCL_RET_LIFECYCLE_STATE_REGISTERED: u32 = 3000;
pub const RCL_RET_LIFECYCLE_STATE_NOT_REGISTERED: u32 = 3001;
pub const RCL_ACTION_RET_NOT_TERMINATED_YET: u32 = 4001;
pub const RCL_ROS_ARGS_FLAG: &[u8; 11] = b"--ros-args\0";
pub const RCL_ROS_ARGS_EXPLICIT_END_TOKEN: &[u8; 3] = b"--\0";
pub const RCL_PARAM_FLAG: &[u8; 8] = b"--param\0";
pub const RCL_SHORT_PARAM_FLAG: &[u8; 3] = b"-p\0";
pub const RCL_PARAM_FILE_FLAG: &[u8; 14] = b"--params-file\0";
pub const RCL_REMAP_FLAG: &[u8; 8] = b"--remap\0";
pub const RCL_SHORT_REMAP_FLAG: &[u8; 3] = b"-r\0";
pub const RCL_ENCLAVE_FLAG: &[u8; 10] = b"--enclave\0";
pub const RCL_SHORT_ENCLAVE_FLAG: &[u8; 3] = b"-e\0";
pub const RCL_LOG_LEVEL_FLAG: &[u8; 12] = b"--log-level\0";
pub const RCL_EXTERNAL_LOG_FILE_NAME_PREFIX: &[u8; 16] = b"--log-file-name\0";
pub const RCL_EXTERNAL_LOG_CONFIG_FLAG: &[u8; 18] = b"--log-config-file\0";
pub const RCL_LOG_STDOUT_FLAG_SUFFIX: &[u8; 12] = b"stdout-logs\0";
pub const RCL_LOG_ROSOUT_FLAG_SUFFIX: &[u8; 12] = b"rosout-logs\0";
pub const RCL_LOG_EXT_LIB_FLAG_SUFFIX: &[u8; 18] = b"external-lib-logs\0";
pub const RCL_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCL_NODE_OPTIONS_DEFAULT_DOMAIN_ID: i32 = -1;
pub const RCL_SERVICE_INTROSPECTION_TOPIC_POSTFIX: &[u8; 16] = b"/_service_event\0";
pub type rcutils_ret_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_allocator_s {
    pub allocate: ::std::option::Option<
        unsafe extern "C" fn(
            size: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub deallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            state: *mut ::std::os::raw::c_void,
        ),
    >,
    pub reallocate: ::std::option::Option<
        unsafe extern "C" fn(
            pointer: *mut ::std::os::raw::c_void,
            size: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub zero_allocate: ::std::option::Option<
        unsafe extern "C" fn(
            number_of_elements: usize,
            size_of_element: usize,
            state: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub state: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_allocator_s"][::std::mem::size_of::<rcutils_allocator_s>() - 40usize];
    ["Alignment of rcutils_allocator_s"][::std::mem::align_of::<rcutils_allocator_s>() - 8usize];
    ["Offset of field: rcutils_allocator_s::allocate"]
        [::std::mem::offset_of!(rcutils_allocator_s, allocate) - 0usize];
    ["Offset of field: rcutils_allocator_s::deallocate"]
        [::std::mem::offset_of!(rcutils_allocator_s, deallocate) - 8usize];
    ["Offset of field: rcutils_allocator_s::reallocate"]
        [::std::mem::offset_of!(rcutils_allocator_s, reallocate) - 16usize];
    ["Offset of field: rcutils_allocator_s::zero_allocate"]
        [::std::mem::offset_of!(rcutils_allocator_s, zero_allocate) - 24usize];
    ["Offset of field: rcutils_allocator_s::state"]
        [::std::mem::offset_of!(rcutils_allocator_s, state) - 32usize];
};
impl Default for rcutils_allocator_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_allocator_t = rcutils_allocator_s;
pub type rcl_allocator_t = rcutils_allocator_t;
pub type rmw_ret_t = i32;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rmw_automatic_discovery_range_e {
    RMW_AUTOMATIC_DISCOVERY_RANGE_NOT_SET = 0,
    RMW_AUTOMATIC_DISCOVERY_RANGE_OFF = 1,
    RMW_AUTOMATIC_DISCOVERY_RANGE_LOCALHOST = 2,
    RMW_AUTOMATIC_DISCOVERY_RANGE_SUBNET = 3,
    RMW_AUTOMATIC_DISCOVERY_RANGE_SYSTEM_DEFAULT = 4,
}
pub use self::rmw_automatic_discovery_range_e as rmw_automatic_discovery_range_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_peer_address_s {
    pub peer_address: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_peer_address_s"][::std::mem::size_of::<rmw_peer_address_s>() - 256usize];
    ["Alignment of rmw_peer_address_s"][::std::mem::align_of::<rmw_peer_address_s>() - 1usize];
    ["Offset of field: rmw_peer_address_s::peer_address"]
        [::std::mem::offset_of!(rmw_peer_address_s, peer_address) - 0usize];
};
impl Default for rmw_peer_address_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_peer_address_t = rmw_peer_address_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_discovery_options_s {
    pub automatic_discovery_range: rmw_automatic_discovery_range_t,
    pub static_peers: *mut rmw_peer_address_t,
    pub static_peers_count: usize,
    pub allocator: rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_discovery_options_s"][::std::mem::size_of::<rmw_discovery_options_s>() - 64usize];
    ["Alignment of rmw_discovery_options_s"]
        [::std::mem::align_of::<rmw_discovery_options_s>() - 8usize];
    ["Offset of field: rmw_discovery_options_s::automatic_discovery_range"]
        [::std::mem::offset_of!(rmw_discovery_options_s, automatic_discovery_range) - 0usize];
    ["Offset of field: rmw_discovery_options_s::static_peers"]
        [::std::mem::offset_of!(rmw_discovery_options_s, static_peers) - 8usize];
    ["Offset of field: rmw_discovery_options_s::static_peers_count"]
        [::std::mem::offset_of!(rmw_discovery_options_s, static_peers_count) - 16usize];
    ["Offset of field: rmw_discovery_options_s::allocator"]
        [::std::mem::offset_of!(rmw_discovery_options_s, allocator) - 24usize];
};
impl Default for rmw_discovery_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_discovery_options_t = rmw_discovery_options_s;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rmw_localhost_only_e {
    RMW_LOCALHOST_ONLY_DEFAULT = 0,
    RMW_LOCALHOST_ONLY_ENABLED = 1,
    RMW_LOCALHOST_ONLY_DISABLED = 2,
}
pub use self::rmw_localhost_only_e as rmw_localhost_only_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rmw_security_enforcement_policy_e {
    RMW_SECURITY_ENFORCEMENT_PERMISSIVE = 0,
    RMW_SECURITY_ENFORCEMENT_ENFORCE = 1,
}
pub use self::rmw_security_enforcement_policy_e as rmw_security_enforcement_policy_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_security_options_s {
    pub enforce_security: rmw_security_enforcement_policy_t,
    pub security_root_path: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_security_options_s"][::std::mem::size_of::<rmw_security_options_s>() - 16usize];
    ["Alignment of rmw_security_options_s"]
        [::std::mem::align_of::<rmw_security_options_s>() - 8usize];
    ["Offset of field: rmw_security_options_s::enforce_security"]
        [::std::mem::offset_of!(rmw_security_options_s, enforce_security) - 0usize];
    ["Offset of field: rmw_security_options_s::security_root_path"]
        [::std::mem::offset_of!(rmw_security_options_s, security_root_path) - 8usize];
};
impl Default for rmw_security_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_security_options_t = rmw_security_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_init_options_impl_s {
    _unused: [u8; 0],
}
pub type rmw_init_options_impl_t = rmw_init_options_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_init_options_s {
    pub instance_id: u64,
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub domain_id: usize,
    pub security_options: rmw_security_options_t,
    pub localhost_only: rmw_localhost_only_t,
    pub discovery_options: rmw_discovery_options_t,
    pub enclave: *mut ::std::os::raw::c_char,
    pub allocator: rcutils_allocator_t,
    pub impl_: *mut rmw_init_options_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_init_options_s"][::std::mem::size_of::<rmw_init_options_s>() - 168usize];
    ["Alignment of rmw_init_options_s"][::std::mem::align_of::<rmw_init_options_s>() - 8usize];
    ["Offset of field: rmw_init_options_s::instance_id"]
        [::std::mem::offset_of!(rmw_init_options_s, instance_id) - 0usize];
    ["Offset of field: rmw_init_options_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_init_options_s, implementation_identifier) - 8usize];
    ["Offset of field: rmw_init_options_s::domain_id"]
        [::std::mem::offset_of!(rmw_init_options_s, domain_id) - 16usize];
    ["Offset of field: rmw_init_options_s::security_options"]
        [::std::mem::offset_of!(rmw_init_options_s, security_options) - 24usize];
    ["Offset of field: rmw_init_options_s::localhost_only"]
        [::std::mem::offset_of!(rmw_init_options_s, localhost_only) - 40usize];
    ["Offset of field: rmw_init_options_s::discovery_options"]
        [::std::mem::offset_of!(rmw_init_options_s, discovery_options) - 48usize];
    ["Offset of field: rmw_init_options_s::enclave"]
        [::std::mem::offset_of!(rmw_init_options_s, enclave) - 112usize];
    ["Offset of field: rmw_init_options_s::allocator"]
        [::std::mem::offset_of!(rmw_init_options_s, allocator) - 120usize];
    ["Offset of field: rmw_init_options_s::impl_"]
        [::std::mem::offset_of!(rmw_init_options_s, impl_) - 160usize];
};
impl Default for rmw_init_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_init_options_t = rmw_init_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rmw_context_impl_s {
    _unused: [u8; 0],
}
pub type rmw_context_impl_t = rmw_context_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_context_s {
    pub instance_id: u64,
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub options: rmw_init_options_t,
    pub actual_domain_id: usize,
    pub impl_: *mut rmw_context_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_context_s"][::std::mem::size_of::<rmw_context_s>() - 200usize];
    ["Alignment of rmw_context_s"][::std::mem::align_of::<rmw_context_s>() - 8usize];
    ["Offset of field: rmw_context_s::instance_id"]
        [::std::mem::offset_of!(rmw_context_s, instance_id) - 0usize];
    ["Offset of field: rmw_context_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_context_s, implementation_identifier) - 8usize];
    ["Offset of field: rmw_context_s::options"]
        [::std::mem::offset_of!(rmw_context_s, options) - 16usize];
    ["Offset of field: rmw_context_s::actual_domain_id"]
        [::std::mem::offset_of!(rmw_context_s, actual_domain_id) - 184usize];
    ["Offset of field: rmw_context_s::impl_"]
        [::std::mem::offset_of!(rmw_context_s, impl_) - 192usize];
};
impl Default for rmw_context_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_context_t = rmw_context_s;
pub type va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_error_string_s {
    pub str_: [::std::os::raw::c_char; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_error_string_s"][::std::mem::size_of::<rcutils_error_string_s>() - 1024usize];
    ["Alignment of rcutils_error_string_s"]
        [::std::mem::align_of::<rcutils_error_string_s>() - 1usize];
    ["Offset of field: rcutils_error_string_s::str_"]
        [::std::mem::offset_of!(rcutils_error_string_s, str_) - 0usize];
};
impl Default for rcutils_error_string_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_error_string_t = rcutils_error_string_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_error_state_s {
    pub message: [::std::os::raw::c_char; 768usize],
    pub file: [::std::os::raw::c_char; 229usize],
    pub line_number: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_error_state_s"][::std::mem::size_of::<rcutils_error_state_s>() - 1008usize];
    ["Alignment of rcutils_error_state_s"]
        [::std::mem::align_of::<rcutils_error_state_s>() - 8usize];
    ["Offset of field: rcutils_error_state_s::message"]
        [::std::mem::offset_of!(rcutils_error_state_s, message) - 0usize];
    ["Offset of field: rcutils_error_state_s::file"]
        [::std::mem::offset_of!(rcutils_error_state_s, file) - 768usize];
    ["Offset of field: rcutils_error_state_s::line_number"]
        [::std::mem::offset_of!(rcutils_error_state_s, line_number) - 1000usize];
};
impl Default for rcutils_error_state_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_error_state_t = rcutils_error_state_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_string_array_s {
    pub size: usize,
    pub data: *mut *mut ::std::os::raw::c_char,
    pub allocator: rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_string_array_s"][::std::mem::size_of::<rcutils_string_array_s>() - 56usize];
    ["Alignment of rcutils_string_array_s"]
        [::std::mem::align_of::<rcutils_string_array_s>() - 8usize];
    ["Offset of field: rcutils_string_array_s::size"]
        [::std::mem::offset_of!(rcutils_string_array_s, size) - 0usize];
    ["Offset of field: rcutils_string_array_s::data"]
        [::std::mem::offset_of!(rcutils_string_array_s, data) - 8usize];
    ["Offset of field: rcutils_string_array_s::allocator"]
        [::std::mem::offset_of!(rcutils_string_array_s, allocator) - 16usize];
};
impl Default for rcutils_string_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_string_array_t = rcutils_string_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcutils_string_map_impl_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_string_map_s {
    pub impl_: *mut rcutils_string_map_impl_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_string_map_s"][::std::mem::size_of::<rcutils_string_map_s>() - 8usize];
    ["Alignment of rcutils_string_map_s"][::std::mem::align_of::<rcutils_string_map_s>() - 8usize];
    ["Offset of field: rcutils_string_map_s::impl_"]
        [::std::mem::offset_of!(rcutils_string_map_s, impl_) - 0usize];
};
impl Default for rcutils_string_map_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_string_map_t = rcutils_string_map_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_uint8_array_s {
    pub buffer: *mut u8,
    pub buffer_length: usize,
    pub buffer_capacity: usize,
    pub allocator: rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_uint8_array_s"][::std::mem::size_of::<rcutils_uint8_array_s>() - 64usize];
    ["Alignment of rcutils_uint8_array_s"]
        [::std::mem::align_of::<rcutils_uint8_array_s>() - 8usize];
    ["Offset of field: rcutils_uint8_array_s::buffer"]
        [::std::mem::offset_of!(rcutils_uint8_array_s, buffer) - 0usize];
    ["Offset of field: rcutils_uint8_array_s::buffer_length"]
        [::std::mem::offset_of!(rcutils_uint8_array_s, buffer_length) - 8usize];
    ["Offset of field: rcutils_uint8_array_s::buffer_capacity"]
        [::std::mem::offset_of!(rcutils_uint8_array_s, buffer_capacity) - 16usize];
    ["Offset of field: rcutils_uint8_array_s::allocator"]
        [::std::mem::offset_of!(rcutils_uint8_array_s, allocator) - 24usize];
};
impl Default for rcutils_uint8_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_uint8_array_t = rcutils_uint8_array_s;
pub type rcutils_time_point_value_t = i64;
pub type rcutils_duration_value_t = i64;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcutils_log_location_s {
    pub function_name: *const ::std::os::raw::c_char,
    pub file_name: *const ::std::os::raw::c_char,
    pub line_number: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcutils_log_location_s"][::std::mem::size_of::<rcutils_log_location_s>() - 24usize];
    ["Alignment of rcutils_log_location_s"]
        [::std::mem::align_of::<rcutils_log_location_s>() - 8usize];
    ["Offset of field: rcutils_log_location_s::function_name"]
        [::std::mem::offset_of!(rcutils_log_location_s, function_name) - 0usize];
    ["Offset of field: rcutils_log_location_s::file_name"]
        [::std::mem::offset_of!(rcutils_log_location_s, file_name) - 8usize];
    ["Offset of field: rcutils_log_location_s::line_number"]
        [::std::mem::offset_of!(rcutils_log_location_s, line_number) - 16usize];
};
impl Default for rcutils_log_location_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcutils_log_location_t = rcutils_log_location_s;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum RCUTILS_LOG_SEVERITY {
    RCUTILS_LOG_SEVERITY_UNSET = 0,
    RCUTILS_LOG_SEVERITY_DEBUG = 10,
    RCUTILS_LOG_SEVERITY_INFO = 20,
    RCUTILS_LOG_SEVERITY_WARN = 30,
    RCUTILS_LOG_SEVERITY_ERROR = 40,
    RCUTILS_LOG_SEVERITY_FATAL = 50,
}
pub type rcutils_logging_output_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        location: *const rcutils_log_location_t,
        severity: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        timestamp: rcutils_time_point_value_t,
        format: *const ::std::os::raw::c_char,
        args: *mut va_list,
    ),
>;
pub type rmw_serialized_message_t = rcutils_uint8_array_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_subscription_content_filter_options_s {
    pub filter_expression: *mut ::std::os::raw::c_char,
    pub expression_parameters: rcutils_string_array_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_subscription_content_filter_options_s"]
        [::std::mem::size_of::<rmw_subscription_content_filter_options_s>() - 64usize];
    ["Alignment of rmw_subscription_content_filter_options_s"]
        [::std::mem::align_of::<rmw_subscription_content_filter_options_s>() - 8usize];
    ["Offset of field: rmw_subscription_content_filter_options_s::filter_expression"][::std::mem::offset_of!(
        rmw_subscription_content_filter_options_s,
        filter_expression
    ) - 0usize];
    ["Offset of field: rmw_subscription_content_filter_options_s::expression_parameters"][::std::mem::offset_of!(
        rmw_subscription_content_filter_options_s,
        expression_parameters
    )
        - 8usize];
};
impl Default for rmw_subscription_content_filter_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_subscription_content_filter_options_t = rmw_subscription_content_filter_options_s;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rmw_time_s {
    pub sec: u64,
    pub nsec: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_time_s"][::std::mem::size_of::<rmw_time_s>() - 16usize];
    ["Alignment of rmw_time_s"][::std::mem::align_of::<rmw_time_s>() - 8usize];
    ["Offset of field: rmw_time_s::sec"][::std::mem::offset_of!(rmw_time_s, sec) - 0usize];
    ["Offset of field: rmw_time_s::nsec"][::std::mem::offset_of!(rmw_time_s, nsec) - 8usize];
};
pub type rmw_time_point_value_t = rcutils_time_point_value_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_node_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub name: *const ::std::os::raw::c_char,
    pub namespace_: *const ::std::os::raw::c_char,
    pub context: *mut rmw_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_node_s"][::std::mem::size_of::<rmw_node_s>() - 40usize];
    ["Alignment of rmw_node_s"][::std::mem::align_of::<rmw_node_s>() - 8usize];
    ["Offset of field: rmw_node_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_node_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_node_s::data"][::std::mem::offset_of!(rmw_node_s, data) - 8usize];
    ["Offset of field: rmw_node_s::name"][::std::mem::offset_of!(rmw_node_s, name) - 16usize];
    ["Offset of field: rmw_node_s::namespace_"]
        [::std::mem::offset_of!(rmw_node_s, namespace_) - 24usize];
    ["Offset of field: rmw_node_s::context"][::std::mem::offset_of!(rmw_node_s, context) - 32usize];
};
impl Default for rmw_node_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_node_t = rmw_node_s;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rmw_endpoint_type_e {
    RMW_ENDPOINT_INVALID = 0,
    RMW_ENDPOINT_PUBLISHER = 1,
    RMW_ENDPOINT_SUBSCRIPTION = 2,
}
pub use self::rmw_endpoint_type_e as rmw_endpoint_type_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rmw_unique_network_flow_endpoints_requirement_e {
    RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_NOT_REQUIRED = 0,
    RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_STRICTLY_REQUIRED = 1,
    RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_OPTIONALLY_REQUIRED = 2,
    RMW_UNIQUE_NETWORK_FLOW_ENDPOINTS_SYSTEM_DEFAULT = 3,
}
pub use self::rmw_unique_network_flow_endpoints_requirement_e as rmw_unique_network_flow_endpoints_requirement_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_publisher_options_s {
    pub rmw_specific_publisher_payload: *mut ::std::os::raw::c_void,
    pub require_unique_network_flow_endpoints: rmw_unique_network_flow_endpoints_requirement_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_publisher_options_s"][::std::mem::size_of::<rmw_publisher_options_s>() - 16usize];
    ["Alignment of rmw_publisher_options_s"]
        [::std::mem::align_of::<rmw_publisher_options_s>() - 8usize];
    ["Offset of field: rmw_publisher_options_s::rmw_specific_publisher_payload"]
        [::std::mem::offset_of!(rmw_publisher_options_s, rmw_specific_publisher_payload) - 0usize];
    ["Offset of field: rmw_publisher_options_s::require_unique_network_flow_endpoints"][::std::mem::offset_of!(
        rmw_publisher_options_s,
        require_unique_network_flow_endpoints
    ) - 8usize];
};
impl Default for rmw_publisher_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_publisher_options_t = rmw_publisher_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_publisher_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub topic_name: *const ::std::os::raw::c_char,
    pub options: rmw_publisher_options_t,
    pub can_loan_messages: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_publisher_s"][::std::mem::size_of::<rmw_publisher_s>() - 48usize];
    ["Alignment of rmw_publisher_s"][::std::mem::align_of::<rmw_publisher_s>() - 8usize];
    ["Offset of field: rmw_publisher_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_publisher_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_publisher_s::data"]
        [::std::mem::offset_of!(rmw_publisher_s, data) - 8usize];
    ["Offset of field: rmw_publisher_s::topic_name"]
        [::std::mem::offset_of!(rmw_publisher_s, topic_name) - 16usize];
    ["Offset of field: rmw_publisher_s::options"]
        [::std::mem::offset_of!(rmw_publisher_s, options) - 24usize];
    ["Offset of field: rmw_publisher_s::can_loan_messages"]
        [::std::mem::offset_of!(rmw_publisher_s, can_loan_messages) - 40usize];
};
impl Default for rmw_publisher_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_publisher_t = rmw_publisher_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_subscription_options_s {
    pub rmw_specific_subscription_payload: *mut ::std::os::raw::c_void,
    pub ignore_local_publications: bool,
    pub require_unique_network_flow_endpoints: rmw_unique_network_flow_endpoints_requirement_t,
    pub content_filter_options: *mut rmw_subscription_content_filter_options_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_subscription_options_s"]
        [::std::mem::size_of::<rmw_subscription_options_s>() - 24usize];
    ["Alignment of rmw_subscription_options_s"]
        [::std::mem::align_of::<rmw_subscription_options_s>() - 8usize];
    ["Offset of field: rmw_subscription_options_s::rmw_specific_subscription_payload"][::std::mem::offset_of!(
        rmw_subscription_options_s,
        rmw_specific_subscription_payload
    ) - 0usize];
    ["Offset of field: rmw_subscription_options_s::ignore_local_publications"]
        [::std::mem::offset_of!(rmw_subscription_options_s, ignore_local_publications) - 8usize];
    ["Offset of field: rmw_subscription_options_s::require_unique_network_flow_endpoints"][::std::mem::offset_of!(
        rmw_subscription_options_s,
        require_unique_network_flow_endpoints
    )
        - 12usize];
    ["Offset of field: rmw_subscription_options_s::content_filter_options"]
        [::std::mem::offset_of!(rmw_subscription_options_s, content_filter_options) - 16usize];
};
impl Default for rmw_subscription_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_subscription_options_t = rmw_subscription_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_subscription_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub topic_name: *const ::std::os::raw::c_char,
    pub options: rmw_subscription_options_t,
    pub can_loan_messages: bool,
    pub is_cft_enabled: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_subscription_s"][::std::mem::size_of::<rmw_subscription_s>() - 56usize];
    ["Alignment of rmw_subscription_s"][::std::mem::align_of::<rmw_subscription_s>() - 8usize];
    ["Offset of field: rmw_subscription_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_subscription_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_subscription_s::data"]
        [::std::mem::offset_of!(rmw_subscription_s, data) - 8usize];
    ["Offset of field: rmw_subscription_s::topic_name"]
        [::std::mem::offset_of!(rmw_subscription_s, topic_name) - 16usize];
    ["Offset of field: rmw_subscription_s::options"]
        [::std::mem::offset_of!(rmw_subscription_s, options) - 24usize];
    ["Offset of field: rmw_subscription_s::can_loan_messages"]
        [::std::mem::offset_of!(rmw_subscription_s, can_loan_messages) - 48usize];
    ["Offset of field: rmw_subscription_s::is_cft_enabled"]
        [::std::mem::offset_of!(rmw_subscription_s, is_cft_enabled) - 49usize];
};
impl Default for rmw_subscription_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_subscription_t = rmw_subscription_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_service_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub service_name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_service_s"][::std::mem::size_of::<rmw_service_s>() - 24usize];
    ["Alignment of rmw_service_s"][::std::mem::align_of::<rmw_service_s>() - 8usize];
    ["Offset of field: rmw_service_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_service_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_service_s::data"][::std::mem::offset_of!(rmw_service_s, data) - 8usize];
    ["Offset of field: rmw_service_s::service_name"]
        [::std::mem::offset_of!(rmw_service_s, service_name) - 16usize];
};
impl Default for rmw_service_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_service_t = rmw_service_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_client_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub service_name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_client_s"][::std::mem::size_of::<rmw_client_s>() - 24usize];
    ["Alignment of rmw_client_s"][::std::mem::align_of::<rmw_client_s>() - 8usize];
    ["Offset of field: rmw_client_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_client_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_client_s::data"][::std::mem::offset_of!(rmw_client_s, data) - 8usize];
    ["Offset of field: rmw_client_s::service_name"]
        [::std::mem::offset_of!(rmw_client_s, service_name) - 16usize];
};
impl Default for rmw_client_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_client_t = rmw_client_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_guard_condition_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
    pub context: *mut rmw_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_guard_condition_s"][::std::mem::size_of::<rmw_guard_condition_s>() - 24usize];
    ["Alignment of rmw_guard_condition_s"]
        [::std::mem::align_of::<rmw_guard_condition_s>() - 8usize];
    ["Offset of field: rmw_guard_condition_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_guard_condition_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_guard_condition_s::data"]
        [::std::mem::offset_of!(rmw_guard_condition_s, data) - 8usize];
    ["Offset of field: rmw_guard_condition_s::context"]
        [::std::mem::offset_of!(rmw_guard_condition_s, context) - 16usize];
};
impl Default for rmw_guard_condition_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_guard_condition_t = rmw_guard_condition_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_publisher_allocation_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_publisher_allocation_s"]
        [::std::mem::size_of::<rmw_publisher_allocation_s>() - 16usize];
    ["Alignment of rmw_publisher_allocation_s"]
        [::std::mem::align_of::<rmw_publisher_allocation_s>() - 8usize];
    ["Offset of field: rmw_publisher_allocation_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_publisher_allocation_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_publisher_allocation_s::data"]
        [::std::mem::offset_of!(rmw_publisher_allocation_s, data) - 8usize];
};
impl Default for rmw_publisher_allocation_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_publisher_allocation_t = rmw_publisher_allocation_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_subscription_allocation_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_subscription_allocation_s"]
        [::std::mem::size_of::<rmw_subscription_allocation_s>() - 16usize];
    ["Alignment of rmw_subscription_allocation_s"]
        [::std::mem::align_of::<rmw_subscription_allocation_s>() - 8usize];
    ["Offset of field: rmw_subscription_allocation_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_subscription_allocation_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_subscription_allocation_s::data"]
        [::std::mem::offset_of!(rmw_subscription_allocation_s, data) - 8usize];
};
impl Default for rmw_subscription_allocation_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_subscription_allocation_t = rmw_subscription_allocation_s;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rmw_request_id_s {
    pub writer_guid: [u8; 16usize],
    pub sequence_number: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_request_id_s"][::std::mem::size_of::<rmw_request_id_s>() - 24usize];
    ["Alignment of rmw_request_id_s"][::std::mem::align_of::<rmw_request_id_s>() - 8usize];
    ["Offset of field: rmw_request_id_s::writer_guid"]
        [::std::mem::offset_of!(rmw_request_id_s, writer_guid) - 0usize];
    ["Offset of field: rmw_request_id_s::sequence_number"]
        [::std::mem::offset_of!(rmw_request_id_s, sequence_number) - 16usize];
};
pub type rmw_request_id_t = rmw_request_id_s;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rmw_service_info_s {
    pub source_timestamp: rmw_time_point_value_t,
    pub received_timestamp: rmw_time_point_value_t,
    pub request_id: rmw_request_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_service_info_s"][::std::mem::size_of::<rmw_service_info_s>() - 40usize];
    ["Alignment of rmw_service_info_s"][::std::mem::align_of::<rmw_service_info_s>() - 8usize];
    ["Offset of field: rmw_service_info_s::source_timestamp"]
        [::std::mem::offset_of!(rmw_service_info_s, source_timestamp) - 0usize];
    ["Offset of field: rmw_service_info_s::received_timestamp"]
        [::std::mem::offset_of!(rmw_service_info_s, received_timestamp) - 8usize];
    ["Offset of field: rmw_service_info_s::request_id"]
        [::std::mem::offset_of!(rmw_service_info_s, request_id) - 16usize];
};
pub type rmw_service_info_t = rmw_service_info_s;
pub type rmw_qos_profile_t = rmw_qos_profile_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_gid_s {
    pub implementation_identifier: *const ::std::os::raw::c_char,
    pub data: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_gid_s"][::std::mem::size_of::<rmw_gid_s>() - 24usize];
    ["Alignment of rmw_gid_s"][::std::mem::align_of::<rmw_gid_s>() - 8usize];
    ["Offset of field: rmw_gid_s::implementation_identifier"]
        [::std::mem::offset_of!(rmw_gid_s, implementation_identifier) - 0usize];
    ["Offset of field: rmw_gid_s::data"][::std::mem::offset_of!(rmw_gid_s, data) - 8usize];
};
impl Default for rmw_gid_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_gid_t = rmw_gid_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_message_info_s {
    pub source_timestamp: rmw_time_point_value_t,
    pub received_timestamp: rmw_time_point_value_t,
    pub publication_sequence_number: u64,
    pub reception_sequence_number: u64,
    pub publisher_gid: rmw_gid_t,
    pub from_intra_process: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_message_info_s"][::std::mem::size_of::<rmw_message_info_s>() - 64usize];
    ["Alignment of rmw_message_info_s"][::std::mem::align_of::<rmw_message_info_s>() - 8usize];
    ["Offset of field: rmw_message_info_s::source_timestamp"]
        [::std::mem::offset_of!(rmw_message_info_s, source_timestamp) - 0usize];
    ["Offset of field: rmw_message_info_s::received_timestamp"]
        [::std::mem::offset_of!(rmw_message_info_s, received_timestamp) - 8usize];
    ["Offset of field: rmw_message_info_s::publication_sequence_number"]
        [::std::mem::offset_of!(rmw_message_info_s, publication_sequence_number) - 16usize];
    ["Offset of field: rmw_message_info_s::reception_sequence_number"]
        [::std::mem::offset_of!(rmw_message_info_s, reception_sequence_number) - 24usize];
    ["Offset of field: rmw_message_info_s::publisher_gid"]
        [::std::mem::offset_of!(rmw_message_info_s, publisher_gid) - 32usize];
    ["Offset of field: rmw_message_info_s::from_intra_process"]
        [::std::mem::offset_of!(rmw_message_info_s, from_intra_process) - 56usize];
};
impl Default for rmw_message_info_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_message_info_t = rmw_message_info_s;
pub const RMW_QOS_POLICY_DEPTH_SYSTEM_DEFAULT: _bindgen_ty_1 =
    _bindgen_ty_1::RMW_QOS_POLICY_DEPTH_SYSTEM_DEFAULT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _bindgen_ty_1 {
    RMW_QOS_POLICY_DEPTH_SYSTEM_DEFAULT = 0,
}
pub type rcl_ret_t = rmw_ret_t;
pub type rcl_serialized_message_t = rmw_serialized_message_t;
pub use self::RCUTILS_LOG_SEVERITY as rcl_log_severity_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_logger_setting_s {
    pub name: *const ::std::os::raw::c_char,
    pub level: rcl_log_severity_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_logger_setting_s"][::std::mem::size_of::<rcl_logger_setting_s>() - 16usize];
    ["Alignment of rcl_logger_setting_s"][::std::mem::align_of::<rcl_logger_setting_s>() - 8usize];
    ["Offset of field: rcl_logger_setting_s::name"]
        [::std::mem::offset_of!(rcl_logger_setting_s, name) - 0usize];
    ["Offset of field: rcl_logger_setting_s::level"]
        [::std::mem::offset_of!(rcl_logger_setting_s, level) - 8usize];
};
impl Default for rcl_logger_setting_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_logger_setting_t = rcl_logger_setting_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_log_levels_s {
    pub default_logger_level: rcl_log_severity_t,
    pub logger_settings: *mut rcl_logger_setting_t,
    pub num_logger_settings: usize,
    pub capacity_logger_settings: usize,
    pub allocator: rcl_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_log_levels_s"][::std::mem::size_of::<rcl_log_levels_s>() - 72usize];
    ["Alignment of rcl_log_levels_s"][::std::mem::align_of::<rcl_log_levels_s>() - 8usize];
    ["Offset of field: rcl_log_levels_s::default_logger_level"]
        [::std::mem::offset_of!(rcl_log_levels_s, default_logger_level) - 0usize];
    ["Offset of field: rcl_log_levels_s::logger_settings"]
        [::std::mem::offset_of!(rcl_log_levels_s, logger_settings) - 8usize];
    ["Offset of field: rcl_log_levels_s::num_logger_settings"]
        [::std::mem::offset_of!(rcl_log_levels_s, num_logger_settings) - 16usize];
    ["Offset of field: rcl_log_levels_s::capacity_logger_settings"]
        [::std::mem::offset_of!(rcl_log_levels_s, capacity_logger_settings) - 24usize];
    ["Offset of field: rcl_log_levels_s::allocator"]
        [::std::mem::offset_of!(rcl_log_levels_s, allocator) - 32usize];
};
impl Default for rcl_log_levels_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_log_levels_t = rcl_log_levels_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_log_levels() -> rcl_log_levels_t;
}
unsafe extern "C" {
    pub fn rcl_log_levels_init(
        log_levels: *mut rcl_log_levels_t,
        allocator: *const rcl_allocator_t,
        logger_count: usize,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_log_levels_copy(
        src: *const rcl_log_levels_t,
        dst: *mut rcl_log_levels_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_log_levels_fini(log_levels: *mut rcl_log_levels_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_log_levels_shrink_to_size(log_levels: *mut rcl_log_levels_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_log_levels_add_logger_setting(
        log_levels: *mut rcl_log_levels_t,
        logger_name: *const ::std::os::raw::c_char,
        log_level: rcl_log_severity_t,
    ) -> rcl_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_bool_array_s {
    pub values: *mut bool,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_bool_array_s"][::std::mem::size_of::<rcl_bool_array_s>() - 16usize];
    ["Alignment of rcl_bool_array_s"][::std::mem::align_of::<rcl_bool_array_s>() - 8usize];
    ["Offset of field: rcl_bool_array_s::values"]
        [::std::mem::offset_of!(rcl_bool_array_s, values) - 0usize];
    ["Offset of field: rcl_bool_array_s::size"]
        [::std::mem::offset_of!(rcl_bool_array_s, size) - 8usize];
};
impl Default for rcl_bool_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_bool_array_t = rcl_bool_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_int64_array_s {
    pub values: *mut i64,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_int64_array_s"][::std::mem::size_of::<rcl_int64_array_s>() - 16usize];
    ["Alignment of rcl_int64_array_s"][::std::mem::align_of::<rcl_int64_array_s>() - 8usize];
    ["Offset of field: rcl_int64_array_s::values"]
        [::std::mem::offset_of!(rcl_int64_array_s, values) - 0usize];
    ["Offset of field: rcl_int64_array_s::size"]
        [::std::mem::offset_of!(rcl_int64_array_s, size) - 8usize];
};
impl Default for rcl_int64_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_int64_array_t = rcl_int64_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_double_array_s {
    pub values: *mut f64,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_double_array_s"][::std::mem::size_of::<rcl_double_array_s>() - 16usize];
    ["Alignment of rcl_double_array_s"][::std::mem::align_of::<rcl_double_array_s>() - 8usize];
    ["Offset of field: rcl_double_array_s::values"]
        [::std::mem::offset_of!(rcl_double_array_s, values) - 0usize];
    ["Offset of field: rcl_double_array_s::size"]
        [::std::mem::offset_of!(rcl_double_array_s, size) - 8usize];
};
impl Default for rcl_double_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_double_array_t = rcl_double_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_byte_array_s {
    pub values: *mut u8,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_byte_array_s"][::std::mem::size_of::<rcl_byte_array_s>() - 16usize];
    ["Alignment of rcl_byte_array_s"][::std::mem::align_of::<rcl_byte_array_s>() - 8usize];
    ["Offset of field: rcl_byte_array_s::values"]
        [::std::mem::offset_of!(rcl_byte_array_s, values) - 0usize];
    ["Offset of field: rcl_byte_array_s::size"]
        [::std::mem::offset_of!(rcl_byte_array_s, size) - 8usize];
};
impl Default for rcl_byte_array_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_byte_array_t = rcl_byte_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_variant_s {
    pub bool_value: *mut bool,
    pub integer_value: *mut i64,
    pub double_value: *mut f64,
    pub string_value: *mut ::std::os::raw::c_char,
    pub byte_array_value: *mut rcl_byte_array_t,
    pub bool_array_value: *mut rcl_bool_array_t,
    pub integer_array_value: *mut rcl_int64_array_t,
    pub double_array_value: *mut rcl_double_array_t,
    pub string_array_value: *mut rcutils_string_array_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_variant_s"][::std::mem::size_of::<rcl_variant_s>() - 72usize];
    ["Alignment of rcl_variant_s"][::std::mem::align_of::<rcl_variant_s>() - 8usize];
    ["Offset of field: rcl_variant_s::bool_value"]
        [::std::mem::offset_of!(rcl_variant_s, bool_value) - 0usize];
    ["Offset of field: rcl_variant_s::integer_value"]
        [::std::mem::offset_of!(rcl_variant_s, integer_value) - 8usize];
    ["Offset of field: rcl_variant_s::double_value"]
        [::std::mem::offset_of!(rcl_variant_s, double_value) - 16usize];
    ["Offset of field: rcl_variant_s::string_value"]
        [::std::mem::offset_of!(rcl_variant_s, string_value) - 24usize];
    ["Offset of field: rcl_variant_s::byte_array_value"]
        [::std::mem::offset_of!(rcl_variant_s, byte_array_value) - 32usize];
    ["Offset of field: rcl_variant_s::bool_array_value"]
        [::std::mem::offset_of!(rcl_variant_s, bool_array_value) - 40usize];
    ["Offset of field: rcl_variant_s::integer_array_value"]
        [::std::mem::offset_of!(rcl_variant_s, integer_array_value) - 48usize];
    ["Offset of field: rcl_variant_s::double_array_value"]
        [::std::mem::offset_of!(rcl_variant_s, double_array_value) - 56usize];
    ["Offset of field: rcl_variant_s::string_array_value"]
        [::std::mem::offset_of!(rcl_variant_s, string_array_value) - 64usize];
};
impl Default for rcl_variant_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_variant_t = rcl_variant_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_node_params_s {
    pub parameter_names: *mut *mut ::std::os::raw::c_char,
    pub parameter_values: *mut rcl_variant_t,
    pub num_params: usize,
    pub capacity_params: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_node_params_s"][::std::mem::size_of::<rcl_node_params_s>() - 32usize];
    ["Alignment of rcl_node_params_s"][::std::mem::align_of::<rcl_node_params_s>() - 8usize];
    ["Offset of field: rcl_node_params_s::parameter_names"]
        [::std::mem::offset_of!(rcl_node_params_s, parameter_names) - 0usize];
    ["Offset of field: rcl_node_params_s::parameter_values"]
        [::std::mem::offset_of!(rcl_node_params_s, parameter_values) - 8usize];
    ["Offset of field: rcl_node_params_s::num_params"]
        [::std::mem::offset_of!(rcl_node_params_s, num_params) - 16usize];
    ["Offset of field: rcl_node_params_s::capacity_params"]
        [::std::mem::offset_of!(rcl_node_params_s, capacity_params) - 24usize];
};
impl Default for rcl_node_params_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_node_params_t = rcl_node_params_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_params_s {
    pub node_names: *mut *mut ::std::os::raw::c_char,
    pub params: *mut rcl_node_params_t,
    pub num_nodes: usize,
    pub capacity_nodes: usize,
    pub allocator: rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_params_s"][::std::mem::size_of::<rcl_params_s>() - 72usize];
    ["Alignment of rcl_params_s"][::std::mem::align_of::<rcl_params_s>() - 8usize];
    ["Offset of field: rcl_params_s::node_names"]
        [::std::mem::offset_of!(rcl_params_s, node_names) - 0usize];
    ["Offset of field: rcl_params_s::params"]
        [::std::mem::offset_of!(rcl_params_s, params) - 8usize];
    ["Offset of field: rcl_params_s::num_nodes"]
        [::std::mem::offset_of!(rcl_params_s, num_nodes) - 16usize];
    ["Offset of field: rcl_params_s::capacity_nodes"]
        [::std::mem::offset_of!(rcl_params_s, capacity_nodes) - 24usize];
    ["Offset of field: rcl_params_s::allocator"]
        [::std::mem::offset_of!(rcl_params_s, allocator) - 32usize];
};
impl Default for rcl_params_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_params_t = rcl_params_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_arguments_impl_s {
    _unused: [u8; 0],
}
pub type rcl_arguments_impl_t = rcl_arguments_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_arguments_s {
    pub impl_: *mut rcl_arguments_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_arguments_s"][::std::mem::size_of::<rcl_arguments_s>() - 8usize];
    ["Alignment of rcl_arguments_s"][::std::mem::align_of::<rcl_arguments_s>() - 8usize];
    ["Offset of field: rcl_arguments_s::impl_"]
        [::std::mem::offset_of!(rcl_arguments_s, impl_) - 0usize];
};
impl Default for rcl_arguments_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_arguments_t = rcl_arguments_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_arguments() -> rcl_arguments_t;
}
unsafe extern "C" {
    pub fn rcl_parse_arguments(
        argc: ::std::os::raw::c_int,
        argv: *const *const ::std::os::raw::c_char,
        allocator: rcl_allocator_t,
        args_output: *mut rcl_arguments_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_count_unparsed(args: *const rcl_arguments_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_unparsed(
        args: *const rcl_arguments_t,
        allocator: rcl_allocator_t,
        output_unparsed_indices: *mut *mut ::std::os::raw::c_int,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_count_unparsed_ros(
        args: *const rcl_arguments_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_unparsed_ros(
        args: *const rcl_arguments_t,
        allocator: rcl_allocator_t,
        output_unparsed_ros_indices: *mut *mut ::std::os::raw::c_int,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_param_files_count(
        args: *const rcl_arguments_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_param_files(
        arguments: *const rcl_arguments_t,
        allocator: rcl_allocator_t,
        parameter_files: *mut *mut *mut ::std::os::raw::c_char,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_param_overrides(
        arguments: *const rcl_arguments_t,
        parameter_overrides: *mut *mut rcl_params_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_remove_ros_arguments(
        argv: *const *const ::std::os::raw::c_char,
        args: *const rcl_arguments_t,
        allocator: rcl_allocator_t,
        nonros_argc: *mut ::std::os::raw::c_int,
        nonros_argv: *mut *mut *const ::std::os::raw::c_char,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_get_log_levels(
        arguments: *const rcl_arguments_t,
        log_levels: *mut rcl_log_levels_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_copy(
        args: *const rcl_arguments_t,
        args_out: *mut rcl_arguments_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_arguments_fini(args: *mut rcl_arguments_t) -> rcl_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_init_options_impl_s {
    _unused: [u8; 0],
}
pub type rcl_init_options_impl_t = rcl_init_options_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_init_options_s {
    pub impl_: *mut rcl_init_options_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_init_options_s"][::std::mem::size_of::<rcl_init_options_s>() - 8usize];
    ["Alignment of rcl_init_options_s"][::std::mem::align_of::<rcl_init_options_s>() - 8usize];
    ["Offset of field: rcl_init_options_s::impl_"]
        [::std::mem::offset_of!(rcl_init_options_s, impl_) - 0usize];
};
impl Default for rcl_init_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_init_options_t = rcl_init_options_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_init_options() -> rcl_init_options_t;
}
unsafe extern "C" {
    pub fn rcl_init_options_copy(
        src: *const rcl_init_options_t,
        dst: *mut rcl_init_options_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_init_options_fini(init_options: *mut rcl_init_options_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_init_options_get_domain_id(
        init_options: *const rcl_init_options_t,
        domain_id: *mut usize,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_init_options_set_domain_id(
        init_options: *mut rcl_init_options_t,
        domain_id: usize,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_init_options_get_rmw_init_options(
        init_options: *mut rcl_init_options_t,
    ) -> *mut rmw_init_options_t;
}
pub type rcl_context_instance_id_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_context_impl_s {
    _unused: [u8; 0],
}
pub type rcl_context_impl_t = rcl_context_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_context_s {
    pub global_arguments: rcl_arguments_t,
    pub impl_: *mut rcl_context_impl_t,
    pub instance_id_storage: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_context_s"][::std::mem::size_of::<rcl_context_s>() - 24usize];
    ["Alignment of rcl_context_s"][::std::mem::align_of::<rcl_context_s>() - 8usize];
    ["Offset of field: rcl_context_s::global_arguments"]
        [::std::mem::offset_of!(rcl_context_s, global_arguments) - 0usize];
    ["Offset of field: rcl_context_s::impl_"]
        [::std::mem::offset_of!(rcl_context_s, impl_) - 8usize];
    ["Offset of field: rcl_context_s::instance_id_storage"]
        [::std::mem::offset_of!(rcl_context_s, instance_id_storage) - 16usize];
};
impl Default for rcl_context_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_context_t = rcl_context_s;
unsafe extern "C" {
    pub fn rcl_context_get_init_options(context: *const rcl_context_t)
    -> *const rcl_init_options_t;
}
unsafe extern "C" {
    pub fn rcl_context_get_instance_id(context: *const rcl_context_t) -> rcl_context_instance_id_t;
}
unsafe extern "C" {
    pub fn rcl_context_get_domain_id(
        context: *mut rcl_context_t,
        domain_id: *mut usize,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_context_is_valid(context: *const rcl_context_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_context_get_rmw_context(context: *mut rcl_context_t) -> *mut rmw_context_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_guard_condition_impl_s {
    _unused: [u8; 0],
}
pub type rcl_guard_condition_impl_t = rcl_guard_condition_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_guard_condition_s {
    pub context: *mut rcl_context_t,
    pub impl_: *mut rcl_guard_condition_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_guard_condition_s"][::std::mem::size_of::<rcl_guard_condition_s>() - 16usize];
    ["Alignment of rcl_guard_condition_s"]
        [::std::mem::align_of::<rcl_guard_condition_s>() - 8usize];
    ["Offset of field: rcl_guard_condition_s::context"]
        [::std::mem::offset_of!(rcl_guard_condition_s, context) - 0usize];
    ["Offset of field: rcl_guard_condition_s::impl_"]
        [::std::mem::offset_of!(rcl_guard_condition_s, impl_) - 8usize];
};
impl Default for rcl_guard_condition_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_guard_condition_t = rcl_guard_condition_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_guard_condition_options_s {
    pub allocator: rcl_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_guard_condition_options_s"]
        [::std::mem::size_of::<rcl_guard_condition_options_s>() - 40usize];
    ["Alignment of rcl_guard_condition_options_s"]
        [::std::mem::align_of::<rcl_guard_condition_options_s>() - 8usize];
    ["Offset of field: rcl_guard_condition_options_s::allocator"]
        [::std::mem::offset_of!(rcl_guard_condition_options_s, allocator) - 0usize];
};
impl Default for rcl_guard_condition_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_guard_condition_options_t = rcl_guard_condition_options_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_guard_condition() -> rcl_guard_condition_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_init(
        guard_condition: *mut rcl_guard_condition_t,
        context: *mut rcl_context_t,
        options: rcl_guard_condition_options_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_init_from_rmw(
        guard_condition: *mut rcl_guard_condition_t,
        rmw_guard_condition: *const rmw_guard_condition_t,
        context: *mut rcl_context_t,
        options: rcl_guard_condition_options_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_fini(guard_condition: *mut rcl_guard_condition_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_get_default_options() -> rcl_guard_condition_options_t;
}
unsafe extern "C" {
    pub fn rcl_trigger_guard_condition(guard_condition: *mut rcl_guard_condition_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_get_options(
        guard_condition: *const rcl_guard_condition_t,
    ) -> *const rcl_guard_condition_options_t;
}
unsafe extern "C" {
    pub fn rcl_guard_condition_get_rmw_handle(
        guard_condition: *const rcl_guard_condition_t,
    ) -> *mut rmw_guard_condition_t;
}
unsafe extern "C" {
    pub static RCL_DOMAIN_ID_ENV_VAR: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_get_default_domain_id(domain_id: *mut usize) -> rcl_ret_t;
}
#[repr(C)]
pub struct rcl_node_options_s {
    pub allocator: rcl_allocator_t,
    pub use_global_arguments: bool,
    pub arguments: rcl_arguments_t,
    pub enable_rosout: bool,
    pub rosout_qos: rmw_qos_profile_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_node_options_s"][::std::mem::size_of::<rcl_node_options_s>() - 152usize];
    ["Alignment of rcl_node_options_s"][::std::mem::align_of::<rcl_node_options_s>() - 8usize];
    ["Offset of field: rcl_node_options_s::allocator"]
        [::std::mem::offset_of!(rcl_node_options_s, allocator) - 0usize];
    ["Offset of field: rcl_node_options_s::use_global_arguments"]
        [::std::mem::offset_of!(rcl_node_options_s, use_global_arguments) - 40usize];
    ["Offset of field: rcl_node_options_s::arguments"]
        [::std::mem::offset_of!(rcl_node_options_s, arguments) - 48usize];
    ["Offset of field: rcl_node_options_s::enable_rosout"]
        [::std::mem::offset_of!(rcl_node_options_s, enable_rosout) - 56usize];
    ["Offset of field: rcl_node_options_s::rosout_qos"]
        [::std::mem::offset_of!(rcl_node_options_s, rosout_qos) - 64usize];
};
impl Default for rcl_node_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_node_options_t = rcl_node_options_s;
unsafe extern "C" {
    pub fn rcl_node_get_default_options() -> rcl_node_options_t;
}
unsafe extern "C" {
    pub fn rcl_node_options_copy(
        options: *const rcl_node_options_t,
        options_out: *mut rcl_node_options_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_node_options_fini(options: *mut rcl_node_options_t) -> rcl_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__String {
    pub data: *mut ::std::os::raw::c_char,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__String"]
        [::std::mem::size_of::<rosidl_runtime_c__String>() - 24usize];
    ["Alignment of rosidl_runtime_c__String"]
        [::std::mem::align_of::<rosidl_runtime_c__String>() - 8usize];
    ["Offset of field: rosidl_runtime_c__String::data"]
        [::std::mem::offset_of!(rosidl_runtime_c__String, data) - 0usize];
    ["Offset of field: rosidl_runtime_c__String::size"]
        [::std::mem::offset_of!(rosidl_runtime_c__String, size) - 8usize];
    ["Offset of field: rosidl_runtime_c__String::capacity"]
        [::std::mem::offset_of!(rosidl_runtime_c__String, capacity) - 16usize];
};
impl Default for rosidl_runtime_c__String {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__srv__GetTypeDescription_Request {
    pub type_name: rosidl_runtime_c__String,
    pub type_hash: rosidl_runtime_c__String,
    pub include_type_sources: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__srv__GetTypeDescription_Request"][::std::mem::size_of::<
        type_description_interfaces__srv__GetTypeDescription_Request,
    >() - 56usize];
    ["Alignment of type_description_interfaces__srv__GetTypeDescription_Request"]
        [::std::mem::align_of::<type_description_interfaces__srv__GetTypeDescription_Request>()
            - 8usize];
    ["Offset of field: type_description_interfaces__srv__GetTypeDescription_Request::type_name"][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Request,
        type_name
    )
        - 0usize];
    ["Offset of field: type_description_interfaces__srv__GetTypeDescription_Request::type_hash"][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Request,
        type_hash
    )
        - 24usize];
    [
        "Offset of field: type_description_interfaces__srv__GetTypeDescription_Request::include_type_sources",
    ][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Request,
        include_type_sources
    ) - 48usize];
};
impl Default for type_description_interfaces__srv__GetTypeDescription_Request {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__FieldType {
    pub type_id: u8,
    pub capacity: u64,
    pub string_capacity: u64,
    pub nested_type_name: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__FieldType"]
        [::std::mem::size_of::<type_description_interfaces__msg__FieldType>() - 48usize];
    ["Alignment of type_description_interfaces__msg__FieldType"]
        [::std::mem::align_of::<type_description_interfaces__msg__FieldType>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__FieldType::type_id"]
        [::std::mem::offset_of!(type_description_interfaces__msg__FieldType, type_id) - 0usize];
    ["Offset of field: type_description_interfaces__msg__FieldType::capacity"]
        [::std::mem::offset_of!(type_description_interfaces__msg__FieldType, capacity) - 8usize];
    ["Offset of field: type_description_interfaces__msg__FieldType::string_capacity"][::std::mem::offset_of!(
        type_description_interfaces__msg__FieldType,
        string_capacity
    ) - 16usize];
    ["Offset of field: type_description_interfaces__msg__FieldType::nested_type_name"][::std::mem::offset_of!(
        type_description_interfaces__msg__FieldType,
        nested_type_name
    ) - 24usize];
};
impl Default for type_description_interfaces__msg__FieldType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__Field {
    pub name: rosidl_runtime_c__String,
    pub type_: type_description_interfaces__msg__FieldType,
    pub default_value: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__Field"]
        [::std::mem::size_of::<type_description_interfaces__msg__Field>() - 96usize];
    ["Alignment of type_description_interfaces__msg__Field"]
        [::std::mem::align_of::<type_description_interfaces__msg__Field>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__Field::name"]
        [::std::mem::offset_of!(type_description_interfaces__msg__Field, name) - 0usize];
    ["Offset of field: type_description_interfaces__msg__Field::type_"]
        [::std::mem::offset_of!(type_description_interfaces__msg__Field, type_) - 24usize];
    ["Offset of field: type_description_interfaces__msg__Field::default_value"]
        [::std::mem::offset_of!(type_description_interfaces__msg__Field, default_value) - 72usize];
};
impl Default for type_description_interfaces__msg__Field {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__Field__Sequence {
    pub data: *mut type_description_interfaces__msg__Field,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__Field__Sequence"]
        [::std::mem::size_of::<type_description_interfaces__msg__Field__Sequence>() - 24usize];
    ["Alignment of type_description_interfaces__msg__Field__Sequence"]
        [::std::mem::align_of::<type_description_interfaces__msg__Field__Sequence>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__Field__Sequence::data"]
        [::std::mem::offset_of!(type_description_interfaces__msg__Field__Sequence, data) - 0usize];
    ["Offset of field: type_description_interfaces__msg__Field__Sequence::size"]
        [::std::mem::offset_of!(type_description_interfaces__msg__Field__Sequence, size) - 8usize];
    ["Offset of field: type_description_interfaces__msg__Field__Sequence::capacity"][::std::mem::offset_of!(
        type_description_interfaces__msg__Field__Sequence,
        capacity
    ) - 16usize];
};
impl Default for type_description_interfaces__msg__Field__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__IndividualTypeDescription {
    pub type_name: rosidl_runtime_c__String,
    pub fields: type_description_interfaces__msg__Field__Sequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__IndividualTypeDescription"][::std::mem::size_of::<
        type_description_interfaces__msg__IndividualTypeDescription,
    >() - 48usize];
    ["Alignment of type_description_interfaces__msg__IndividualTypeDescription"]
        [::std::mem::align_of::<type_description_interfaces__msg__IndividualTypeDescription>()
            - 8usize];
    ["Offset of field: type_description_interfaces__msg__IndividualTypeDescription::type_name"][::std::mem::offset_of!(
        type_description_interfaces__msg__IndividualTypeDescription,
        type_name
    )
        - 0usize];
    ["Offset of field: type_description_interfaces__msg__IndividualTypeDescription::fields"][::std::mem::offset_of!(
        type_description_interfaces__msg__IndividualTypeDescription,
        fields
    )
        - 24usize];
};
impl Default for type_description_interfaces__msg__IndividualTypeDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__IndividualTypeDescription__Sequence {
    pub data: *mut type_description_interfaces__msg__IndividualTypeDescription,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__IndividualTypeDescription__Sequence"]
        [::std::mem::size_of::<
            type_description_interfaces__msg__IndividualTypeDescription__Sequence,
        >() - 24usize];
    ["Alignment of type_description_interfaces__msg__IndividualTypeDescription__Sequence"]
        [::std::mem::align_of::<
            type_description_interfaces__msg__IndividualTypeDescription__Sequence,
        >() - 8usize];
    [
        "Offset of field: type_description_interfaces__msg__IndividualTypeDescription__Sequence::data",
    ][::std::mem::offset_of!(
        type_description_interfaces__msg__IndividualTypeDescription__Sequence,
        data
    ) - 0usize];
    [
        "Offset of field: type_description_interfaces__msg__IndividualTypeDescription__Sequence::size",
    ][::std::mem::offset_of!(
        type_description_interfaces__msg__IndividualTypeDescription__Sequence,
        size
    ) - 8usize];
    [
        "Offset of field: type_description_interfaces__msg__IndividualTypeDescription__Sequence::capacity",
    ][::std::mem::offset_of!(
        type_description_interfaces__msg__IndividualTypeDescription__Sequence,
        capacity
    ) - 16usize];
};
impl Default for type_description_interfaces__msg__IndividualTypeDescription__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__TypeDescription {
    pub type_description: type_description_interfaces__msg__IndividualTypeDescription,
    pub referenced_type_descriptions:
        type_description_interfaces__msg__IndividualTypeDescription__Sequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__TypeDescription"]
        [::std::mem::size_of::<type_description_interfaces__msg__TypeDescription>() - 72usize];
    ["Alignment of type_description_interfaces__msg__TypeDescription"]
        [::std::mem::align_of::<type_description_interfaces__msg__TypeDescription>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__TypeDescription::type_description"][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeDescription,
        type_description
    )
        - 0usize];
    [
        "Offset of field: type_description_interfaces__msg__TypeDescription::referenced_type_descriptions",
    ][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeDescription,
        referenced_type_descriptions
    ) - 48usize];
};
impl Default for type_description_interfaces__msg__TypeDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__TypeSource {
    pub type_name: rosidl_runtime_c__String,
    pub encoding: rosidl_runtime_c__String,
    pub raw_file_contents: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__TypeSource"]
        [::std::mem::size_of::<type_description_interfaces__msg__TypeSource>() - 72usize];
    ["Alignment of type_description_interfaces__msg__TypeSource"]
        [::std::mem::align_of::<type_description_interfaces__msg__TypeSource>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource::type_name"]
        [::std::mem::offset_of!(type_description_interfaces__msg__TypeSource, type_name) - 0usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource::encoding"]
        [::std::mem::offset_of!(type_description_interfaces__msg__TypeSource, encoding) - 24usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource::raw_file_contents"][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeSource,
        raw_file_contents
    )
        - 48usize];
};
impl Default for type_description_interfaces__msg__TypeSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__TypeSource__Sequence {
    pub data: *mut type_description_interfaces__msg__TypeSource,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__TypeSource__Sequence"]
        [::std::mem::size_of::<type_description_interfaces__msg__TypeSource__Sequence>() - 24usize];
    ["Alignment of type_description_interfaces__msg__TypeSource__Sequence"]
        [::std::mem::align_of::<type_description_interfaces__msg__TypeSource__Sequence>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource__Sequence::data"][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeSource__Sequence,
        data
    ) - 0usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource__Sequence::size"][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeSource__Sequence,
        size
    ) - 8usize];
    ["Offset of field: type_description_interfaces__msg__TypeSource__Sequence::capacity"][::std::mem::offset_of!(
        type_description_interfaces__msg__TypeSource__Sequence,
        capacity
    )
        - 16usize];
};
impl Default for type_description_interfaces__msg__TypeSource__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__KeyValue {
    pub key: rosidl_runtime_c__String,
    pub value: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__KeyValue"]
        [::std::mem::size_of::<type_description_interfaces__msg__KeyValue>() - 48usize];
    ["Alignment of type_description_interfaces__msg__KeyValue"]
        [::std::mem::align_of::<type_description_interfaces__msg__KeyValue>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__KeyValue::key"]
        [::std::mem::offset_of!(type_description_interfaces__msg__KeyValue, key) - 0usize];
    ["Offset of field: type_description_interfaces__msg__KeyValue::value"]
        [::std::mem::offset_of!(type_description_interfaces__msg__KeyValue, value) - 24usize];
};
impl Default for type_description_interfaces__msg__KeyValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__msg__KeyValue__Sequence {
    pub data: *mut type_description_interfaces__msg__KeyValue,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__msg__KeyValue__Sequence"]
        [::std::mem::size_of::<type_description_interfaces__msg__KeyValue__Sequence>() - 24usize];
    ["Alignment of type_description_interfaces__msg__KeyValue__Sequence"]
        [::std::mem::align_of::<type_description_interfaces__msg__KeyValue__Sequence>() - 8usize];
    ["Offset of field: type_description_interfaces__msg__KeyValue__Sequence::data"][::std::mem::offset_of!(
        type_description_interfaces__msg__KeyValue__Sequence,
        data
    ) - 0usize];
    ["Offset of field: type_description_interfaces__msg__KeyValue__Sequence::size"][::std::mem::offset_of!(
        type_description_interfaces__msg__KeyValue__Sequence,
        size
    ) - 8usize];
    ["Offset of field: type_description_interfaces__msg__KeyValue__Sequence::capacity"][::std::mem::offset_of!(
        type_description_interfaces__msg__KeyValue__Sequence,
        capacity
    )
        - 16usize];
};
impl Default for type_description_interfaces__msg__KeyValue__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct type_description_interfaces__srv__GetTypeDescription_Response {
    pub successful: bool,
    pub failure_reason: rosidl_runtime_c__String,
    pub type_description: type_description_interfaces__msg__TypeDescription,
    pub type_sources: type_description_interfaces__msg__TypeSource__Sequence,
    pub extra_information: type_description_interfaces__msg__KeyValue__Sequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of type_description_interfaces__srv__GetTypeDescription_Response"][::std::mem::size_of::<
        type_description_interfaces__srv__GetTypeDescription_Response,
    >() - 152usize];
    ["Alignment of type_description_interfaces__srv__GetTypeDescription_Response"]
        [::std::mem::align_of::<type_description_interfaces__srv__GetTypeDescription_Response>()
            - 8usize];
    ["Offset of field: type_description_interfaces__srv__GetTypeDescription_Response::successful"]
        [::std::mem::offset_of!(
            type_description_interfaces__srv__GetTypeDescription_Response,
            successful
        ) - 0usize];
    [
        "Offset of field: type_description_interfaces__srv__GetTypeDescription_Response::failure_reason",
    ][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Response,
        failure_reason
    ) - 8usize];
    [
        "Offset of field: type_description_interfaces__srv__GetTypeDescription_Response::type_description",
    ][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Response,
        type_description
    ) - 32usize];
    [
        "Offset of field: type_description_interfaces__srv__GetTypeDescription_Response::type_sources",
    ][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Response,
        type_sources
    ) - 104usize];
    [
        "Offset of field: type_description_interfaces__srv__GetTypeDescription_Response::extra_information",
    ][::std::mem::offset_of!(
        type_description_interfaces__srv__GetTypeDescription_Response,
        extra_information
    ) - 128usize];
};
impl Default for type_description_interfaces__srv__GetTypeDescription_Response {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__FieldType {
    pub type_id: u8,
    pub capacity: u64,
    pub string_capacity: u64,
    pub nested_type_name: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__FieldType"]
        [::std::mem::size_of::<rosidl_runtime_c__type_description__FieldType>() - 48usize];
    ["Alignment of rosidl_runtime_c__type_description__FieldType"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__FieldType>() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__FieldType::type_id"]
        [::std::mem::offset_of!(rosidl_runtime_c__type_description__FieldType, type_id) - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__FieldType::capacity"]
        [::std::mem::offset_of!(rosidl_runtime_c__type_description__FieldType, capacity) - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__FieldType::string_capacity"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__FieldType,
        string_capacity
    )
        - 16usize];
    ["Offset of field: rosidl_runtime_c__type_description__FieldType::nested_type_name"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__FieldType,
        nested_type_name
    )
        - 24usize];
};
impl Default for rosidl_runtime_c__type_description__FieldType {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__Field {
    pub name: rosidl_runtime_c__String,
    pub type_: rosidl_runtime_c__type_description__FieldType,
    pub default_value: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__Field"]
        [::std::mem::size_of::<rosidl_runtime_c__type_description__Field>() - 96usize];
    ["Alignment of rosidl_runtime_c__type_description__Field"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__Field>() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field::name"]
        [::std::mem::offset_of!(rosidl_runtime_c__type_description__Field, name) - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field::type_"]
        [::std::mem::offset_of!(rosidl_runtime_c__type_description__Field, type_) - 24usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field::default_value"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__Field,
        default_value
    ) - 72usize];
};
impl Default for rosidl_runtime_c__type_description__Field {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__Field__Sequence {
    pub data: *mut rosidl_runtime_c__type_description__Field,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__Field__Sequence"]
        [::std::mem::size_of::<rosidl_runtime_c__type_description__Field__Sequence>() - 24usize];
    ["Alignment of rosidl_runtime_c__type_description__Field__Sequence"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__Field__Sequence>() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field__Sequence::data"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__Field__Sequence,
        data
    ) - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field__Sequence::size"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__Field__Sequence,
        size
    ) - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__Field__Sequence::capacity"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__Field__Sequence,
        capacity
    ) - 16usize];
};
impl Default for rosidl_runtime_c__type_description__Field__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__IndividualTypeDescription {
    pub type_name: rosidl_runtime_c__String,
    pub fields: rosidl_runtime_c__type_description__Field__Sequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__IndividualTypeDescription"][::std::mem::size_of::<
        rosidl_runtime_c__type_description__IndividualTypeDescription,
    >() - 48usize];
    ["Alignment of rosidl_runtime_c__type_description__IndividualTypeDescription"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__IndividualTypeDescription>()
            - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__IndividualTypeDescription::type_name"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__IndividualTypeDescription,
        type_name
    )
        - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__IndividualTypeDescription::fields"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__IndividualTypeDescription,
        fields
    )
        - 24usize];
};
impl Default for rosidl_runtime_c__type_description__IndividualTypeDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence {
    pub data: *mut rosidl_runtime_c__type_description__IndividualTypeDescription,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence"]
        [::std::mem::size_of::<
            rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
        >() - 24usize];
    ["Alignment of rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence"]
        [::std::mem::align_of::<
            rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
        >() - 8usize];
    [
        "Offset of field: rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence::data",
    ][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
        data
    ) - 0usize];
    [
        "Offset of field: rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence::size",
    ][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
        size
    ) - 8usize];
    [
        "Offset of field: rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence::capacity",
    ][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
        capacity
    ) - 16usize];
};
impl Default for rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__TypeDescription {
    pub type_description: rosidl_runtime_c__type_description__IndividualTypeDescription,
    pub referenced_type_descriptions:
        rosidl_runtime_c__type_description__IndividualTypeDescription__Sequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__TypeDescription"]
        [::std::mem::size_of::<rosidl_runtime_c__type_description__TypeDescription>() - 72usize];
    ["Alignment of rosidl_runtime_c__type_description__TypeDescription"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__TypeDescription>() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeDescription::type_description"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeDescription,
        type_description
    )
        - 0usize];
    [
        "Offset of field: rosidl_runtime_c__type_description__TypeDescription::referenced_type_descriptions",
    ][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeDescription,
        referenced_type_descriptions
    ) - 48usize];
};
impl Default for rosidl_runtime_c__type_description__TypeDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__TypeSource {
    pub type_name: rosidl_runtime_c__String,
    pub encoding: rosidl_runtime_c__String,
    pub raw_file_contents: rosidl_runtime_c__String,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__TypeSource"]
        [::std::mem::size_of::<rosidl_runtime_c__type_description__TypeSource>() - 72usize];
    ["Alignment of rosidl_runtime_c__type_description__TypeSource"]
        [::std::mem::align_of::<rosidl_runtime_c__type_description__TypeSource>() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource::type_name"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource,
        type_name
    ) - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource::encoding"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource,
        encoding
    ) - 24usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource::raw_file_contents"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource,
        raw_file_contents
    )
        - 48usize];
};
impl Default for rosidl_runtime_c__type_description__TypeSource {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_runtime_c__type_description__TypeSource__Sequence {
    pub data: *mut rosidl_runtime_c__type_description__TypeSource,
    pub size: usize,
    pub capacity: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_runtime_c__type_description__TypeSource__Sequence"][::std::mem::size_of::<
        rosidl_runtime_c__type_description__TypeSource__Sequence,
    >() - 24usize];
    ["Alignment of rosidl_runtime_c__type_description__TypeSource__Sequence"][::std::mem::align_of::<
        rosidl_runtime_c__type_description__TypeSource__Sequence,
    >() - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource__Sequence::data"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource__Sequence,
        data
    ) - 0usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource__Sequence::size"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource__Sequence,
        size
    ) - 8usize];
    ["Offset of field: rosidl_runtime_c__type_description__TypeSource__Sequence::capacity"][::std::mem::offset_of!(
        rosidl_runtime_c__type_description__TypeSource__Sequence,
        capacity
    )
        - 16usize];
};
impl Default for rosidl_runtime_c__type_description__TypeSource__Sequence {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_type_hash_s {
    pub version: u8,
    pub value: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_type_hash_s"][::std::mem::size_of::<rosidl_type_hash_s>() - 33usize];
    ["Alignment of rosidl_type_hash_s"][::std::mem::align_of::<rosidl_type_hash_s>() - 1usize];
    ["Offset of field: rosidl_type_hash_s::version"]
        [::std::mem::offset_of!(rosidl_type_hash_s, version) - 0usize];
    ["Offset of field: rosidl_type_hash_s::value"]
        [::std::mem::offset_of!(rosidl_type_hash_s, value) - 1usize];
};
pub type rosidl_type_hash_t = rosidl_type_hash_s;
pub type rosidl_message_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t,
>;
pub type rosidl_message_get_type_hash_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const rosidl_message_type_support_t) -> *const rosidl_type_hash_t,
>;
pub type rosidl_message_get_type_description_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
    ) -> *const rosidl_runtime_c__type_description__TypeDescription,
>;
pub type rosidl_message_get_type_description_sources_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
    ) -> *const rosidl_runtime_c__type_description__TypeSource__Sequence,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_message_type_support_t {
    pub typesupport_identifier: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub func: rosidl_message_typesupport_handle_function,
    pub get_type_hash_func: rosidl_message_get_type_hash_function,
    pub get_type_description_func: rosidl_message_get_type_description_function,
    pub get_type_description_sources_func: rosidl_message_get_type_description_sources_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_message_type_support_t"]
        [::std::mem::size_of::<rosidl_message_type_support_t>() - 48usize];
    ["Alignment of rosidl_message_type_support_t"]
        [::std::mem::align_of::<rosidl_message_type_support_t>() - 8usize];
    ["Offset of field: rosidl_message_type_support_t::typesupport_identifier"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, typesupport_identifier) - 0usize];
    ["Offset of field: rosidl_message_type_support_t::data"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, data) - 8usize];
    ["Offset of field: rosidl_message_type_support_t::func"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, func) - 16usize];
    ["Offset of field: rosidl_message_type_support_t::get_type_hash_func"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, get_type_hash_func) - 24usize];
    ["Offset of field: rosidl_message_type_support_t::get_type_description_func"][::std::mem::offset_of!(
        rosidl_message_type_support_t,
        get_type_description_func
    ) - 32usize];
    ["Offset of field: rosidl_message_type_support_t::get_type_description_sources_func"][::std::mem::offset_of!(
        rosidl_message_type_support_t,
        get_type_description_sources_func
    )
        - 40usize];
};
impl Default for rosidl_message_type_support_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rosidl_service_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_service_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_service_type_support_t,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_service_introspection_info_s {
    pub event_type: u8,
    pub stamp_sec: i32,
    pub stamp_nanosec: u32,
    pub client_gid: [u8; 16usize],
    pub sequence_number: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_service_introspection_info_s"]
        [::std::mem::size_of::<rosidl_service_introspection_info_s>() - 40usize];
    ["Alignment of rosidl_service_introspection_info_s"]
        [::std::mem::align_of::<rosidl_service_introspection_info_s>() - 8usize];
    ["Offset of field: rosidl_service_introspection_info_s::event_type"]
        [::std::mem::offset_of!(rosidl_service_introspection_info_s, event_type) - 0usize];
    ["Offset of field: rosidl_service_introspection_info_s::stamp_sec"]
        [::std::mem::offset_of!(rosidl_service_introspection_info_s, stamp_sec) - 4usize];
    ["Offset of field: rosidl_service_introspection_info_s::stamp_nanosec"]
        [::std::mem::offset_of!(rosidl_service_introspection_info_s, stamp_nanosec) - 8usize];
    ["Offset of field: rosidl_service_introspection_info_s::client_gid"]
        [::std::mem::offset_of!(rosidl_service_introspection_info_s, client_gid) - 12usize];
    ["Offset of field: rosidl_service_introspection_info_s::sequence_number"]
        [::std::mem::offset_of!(rosidl_service_introspection_info_s, sequence_number) - 32usize];
};
pub type rosidl_service_introspection_info_t = rosidl_service_introspection_info_s;
pub type rosidl_event_message_create_handle_function_function = ::std::option::Option<
    unsafe extern "C" fn(
        info: *const rosidl_service_introspection_info_t,
        allocator: *mut rcutils_allocator_t,
        request_message: *const ::std::os::raw::c_void,
        response_message: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type rosidl_event_message_destroy_handle_function_function = ::std::option::Option<
    unsafe extern "C" fn(
        event_message: *mut ::std::os::raw::c_void,
        allocator: *mut rcutils_allocator_t,
    ) -> bool,
>;
pub type rosidl_service_get_type_hash_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const rosidl_service_type_support_t) -> *const rosidl_type_hash_t,
>;
pub type rosidl_service_get_type_description_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_service_type_support_t,
    ) -> *const rosidl_runtime_c__type_description__TypeDescription,
>;
pub type rosidl_service_get_type_description_sources_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_service_type_support_t,
    ) -> *const rosidl_runtime_c__type_description__TypeSource__Sequence,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_service_type_support_t {
    pub typesupport_identifier: *const ::std::os::raw::c_char,
    pub data: *const ::std::os::raw::c_void,
    pub func: rosidl_service_typesupport_handle_function,
    pub request_typesupport: *const rosidl_message_type_support_t,
    pub response_typesupport: *const rosidl_message_type_support_t,
    pub event_typesupport: *const rosidl_message_type_support_t,
    pub event_message_create_handle_function: rosidl_event_message_create_handle_function_function,
    pub event_message_destroy_handle_function:
        rosidl_event_message_destroy_handle_function_function,
    pub get_type_hash_func: rosidl_service_get_type_hash_function,
    pub get_type_description_func: rosidl_service_get_type_description_function,
    pub get_type_description_sources_func: rosidl_service_get_type_description_sources_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_service_type_support_t"]
        [::std::mem::size_of::<rosidl_service_type_support_t>() - 88usize];
    ["Alignment of rosidl_service_type_support_t"]
        [::std::mem::align_of::<rosidl_service_type_support_t>() - 8usize];
    ["Offset of field: rosidl_service_type_support_t::typesupport_identifier"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, typesupport_identifier) - 0usize];
    ["Offset of field: rosidl_service_type_support_t::data"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, data) - 8usize];
    ["Offset of field: rosidl_service_type_support_t::func"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, func) - 16usize];
    ["Offset of field: rosidl_service_type_support_t::request_typesupport"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, request_typesupport) - 24usize];
    ["Offset of field: rosidl_service_type_support_t::response_typesupport"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, response_typesupport) - 32usize];
    ["Offset of field: rosidl_service_type_support_t::event_typesupport"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, event_typesupport) - 40usize];
    ["Offset of field: rosidl_service_type_support_t::event_message_create_handle_function"][::std::mem::offset_of!(
        rosidl_service_type_support_t,
        event_message_create_handle_function
    )
        - 48usize];
    ["Offset of field: rosidl_service_type_support_t::event_message_destroy_handle_function"][::std::mem::offset_of!(
        rosidl_service_type_support_t,
        event_message_destroy_handle_function
    )
        - 56usize];
    ["Offset of field: rosidl_service_type_support_t::get_type_hash_func"]
        [::std::mem::offset_of!(rosidl_service_type_support_t, get_type_hash_func) - 64usize];
    ["Offset of field: rosidl_service_type_support_t::get_type_description_func"][::std::mem::offset_of!(
        rosidl_service_type_support_t,
        get_type_description_func
    ) - 72usize];
    ["Offset of field: rosidl_service_type_support_t::get_type_description_sources_func"][::std::mem::offset_of!(
        rosidl_service_type_support_t,
        get_type_description_sources_func
    )
        - 80usize];
};
impl Default for rosidl_service_type_support_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn rosidl_typesupport_c__get_service_type_support_handle__type_description_interfaces__srv__GetTypeDescription()
    -> *const rosidl_service_type_support_t;
}
unsafe extern "C" {
    pub static RCL_DISABLE_LOANED_MESSAGES_ENV_VAR: *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_node_impl_s {
    _unused: [u8; 0],
}
pub type rcl_node_impl_t = rcl_node_impl_s;
pub type rcl_service_t = rcl_service_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_node_s {
    pub context: *mut rcl_context_t,
    pub impl_: *mut rcl_node_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_node_s"][::std::mem::size_of::<rcl_node_s>() - 16usize];
    ["Alignment of rcl_node_s"][::std::mem::align_of::<rcl_node_s>() - 8usize];
    ["Offset of field: rcl_node_s::context"][::std::mem::offset_of!(rcl_node_s, context) - 0usize];
    ["Offset of field: rcl_node_s::impl_"][::std::mem::offset_of!(rcl_node_s, impl_) - 8usize];
};
impl Default for rcl_node_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_node_t = rcl_node_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_node() -> rcl_node_t;
}
unsafe extern "C" {
    pub fn rcl_node_is_valid(node: *const rcl_node_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_node_is_valid_except_context(node: *const rcl_node_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_node_get_name(node: *const rcl_node_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_node_get_namespace(node: *const rcl_node_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_node_get_fully_qualified_name(
        node: *const rcl_node_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_node_get_options(node: *const rcl_node_t) -> *const rcl_node_options_t;
}
unsafe extern "C" {
    pub fn rcl_node_get_domain_id(node: *const rcl_node_t, domain_id: *mut usize) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_node_get_rmw_handle(node: *const rcl_node_t) -> *mut rmw_node_t;
}
unsafe extern "C" {
    pub fn rcl_node_get_rcl_instance_id(node: *const rcl_node_t) -> u64;
}
unsafe extern "C" {
    pub fn rcl_node_get_graph_guard_condition(
        node: *const rcl_node_t,
    ) -> *const rcl_guard_condition_t;
}
unsafe extern "C" {
    pub fn rcl_node_get_logger_name(node: *const rcl_node_t) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_node_resolve_name(
        node: *const rcl_node_t,
        input_name: *const ::std::os::raw::c_char,
        allocator: rcl_allocator_t,
        is_service: bool,
        only_expand: bool,
        output_name: *mut *mut ::std::os::raw::c_char,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_get_disable_loaned_message(disable_loaned_message: *mut bool) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_node_type_description_service_init(
        service: *mut rcl_service_t,
        node: *const rcl_node_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_node_type_description_service_handle_request(
        node: *mut rcl_node_t,
        request_header: *const rmw_request_id_t,
        request: *const type_description_interfaces__srv__GetTypeDescription_Request,
        response: *mut type_description_interfaces__srv__GetTypeDescription_Response,
    );
}
pub type rcl_time_point_value_t = rcutils_time_point_value_t;
pub type rcl_duration_value_t = rcutils_duration_value_t;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rcl_clock_type_e {
    RCL_CLOCK_UNINITIALIZED = 0,
    RCL_ROS_TIME = 1,
    RCL_SYSTEM_TIME = 2,
    RCL_STEADY_TIME = 3,
}
pub use self::rcl_clock_type_e as rcl_clock_type_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rcl_duration_s {
    pub nanoseconds: rcl_duration_value_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_duration_s"][::std::mem::size_of::<rcl_duration_s>() - 8usize];
    ["Alignment of rcl_duration_s"][::std::mem::align_of::<rcl_duration_s>() - 8usize];
    ["Offset of field: rcl_duration_s::nanoseconds"]
        [::std::mem::offset_of!(rcl_duration_s, nanoseconds) - 0usize];
};
pub type rcl_duration_t = rcl_duration_s;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rcl_clock_change_e {
    RCL_ROS_TIME_NO_CHANGE = 1,
    RCL_ROS_TIME_ACTIVATED = 2,
    RCL_ROS_TIME_DEACTIVATED = 3,
    RCL_SYSTEM_TIME_NO_CHANGE = 4,
}
pub use self::rcl_clock_change_e as rcl_clock_change_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_time_jump_s {
    pub clock_change: rcl_clock_change_t,
    pub delta: rcl_duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_time_jump_s"][::std::mem::size_of::<rcl_time_jump_s>() - 16usize];
    ["Alignment of rcl_time_jump_s"][::std::mem::align_of::<rcl_time_jump_s>() - 8usize];
    ["Offset of field: rcl_time_jump_s::clock_change"]
        [::std::mem::offset_of!(rcl_time_jump_s, clock_change) - 0usize];
    ["Offset of field: rcl_time_jump_s::delta"]
        [::std::mem::offset_of!(rcl_time_jump_s, delta) - 8usize];
};
impl Default for rcl_time_jump_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_time_jump_t = rcl_time_jump_s;
pub type rcl_jump_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        time_jump: *const rcl_time_jump_t,
        before_jump: bool,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rcl_jump_threshold_s {
    pub on_clock_change: bool,
    pub min_forward: rcl_duration_t,
    pub min_backward: rcl_duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_jump_threshold_s"][::std::mem::size_of::<rcl_jump_threshold_s>() - 24usize];
    ["Alignment of rcl_jump_threshold_s"][::std::mem::align_of::<rcl_jump_threshold_s>() - 8usize];
    ["Offset of field: rcl_jump_threshold_s::on_clock_change"]
        [::std::mem::offset_of!(rcl_jump_threshold_s, on_clock_change) - 0usize];
    ["Offset of field: rcl_jump_threshold_s::min_forward"]
        [::std::mem::offset_of!(rcl_jump_threshold_s, min_forward) - 8usize];
    ["Offset of field: rcl_jump_threshold_s::min_backward"]
        [::std::mem::offset_of!(rcl_jump_threshold_s, min_backward) - 16usize];
};
pub type rcl_jump_threshold_t = rcl_jump_threshold_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_jump_callback_info_s {
    pub callback: rcl_jump_callback_t,
    pub threshold: rcl_jump_threshold_t,
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_jump_callback_info_s"]
        [::std::mem::size_of::<rcl_jump_callback_info_s>() - 40usize];
    ["Alignment of rcl_jump_callback_info_s"]
        [::std::mem::align_of::<rcl_jump_callback_info_s>() - 8usize];
    ["Offset of field: rcl_jump_callback_info_s::callback"]
        [::std::mem::offset_of!(rcl_jump_callback_info_s, callback) - 0usize];
    ["Offset of field: rcl_jump_callback_info_s::threshold"]
        [::std::mem::offset_of!(rcl_jump_callback_info_s, threshold) - 8usize];
    ["Offset of field: rcl_jump_callback_info_s::user_data"]
        [::std::mem::offset_of!(rcl_jump_callback_info_s, user_data) - 32usize];
};
impl Default for rcl_jump_callback_info_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_jump_callback_info_t = rcl_jump_callback_info_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_clock_s {
    pub type_: rcl_clock_type_t,
    pub jump_callbacks: *mut rcl_jump_callback_info_t,
    pub num_jump_callbacks: usize,
    pub get_now: ::std::option::Option<
        unsafe extern "C" fn(
            data: *mut ::std::os::raw::c_void,
            now: *mut rcl_time_point_value_t,
        ) -> rcl_ret_t,
    >,
    pub data: *mut ::std::os::raw::c_void,
    pub allocator: rcl_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_clock_s"][::std::mem::size_of::<rcl_clock_s>() - 80usize];
    ["Alignment of rcl_clock_s"][::std::mem::align_of::<rcl_clock_s>() - 8usize];
    ["Offset of field: rcl_clock_s::type_"][::std::mem::offset_of!(rcl_clock_s, type_) - 0usize];
    ["Offset of field: rcl_clock_s::jump_callbacks"]
        [::std::mem::offset_of!(rcl_clock_s, jump_callbacks) - 8usize];
    ["Offset of field: rcl_clock_s::num_jump_callbacks"]
        [::std::mem::offset_of!(rcl_clock_s, num_jump_callbacks) - 16usize];
    ["Offset of field: rcl_clock_s::get_now"]
        [::std::mem::offset_of!(rcl_clock_s, get_now) - 24usize];
    ["Offset of field: rcl_clock_s::data"][::std::mem::offset_of!(rcl_clock_s, data) - 32usize];
    ["Offset of field: rcl_clock_s::allocator"]
        [::std::mem::offset_of!(rcl_clock_s, allocator) - 40usize];
};
impl Default for rcl_clock_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_clock_t = rcl_clock_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_time_point_s {
    pub nanoseconds: rcl_time_point_value_t,
    pub clock_type: rcl_clock_type_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_time_point_s"][::std::mem::size_of::<rcl_time_point_s>() - 16usize];
    ["Alignment of rcl_time_point_s"][::std::mem::align_of::<rcl_time_point_s>() - 8usize];
    ["Offset of field: rcl_time_point_s::nanoseconds"]
        [::std::mem::offset_of!(rcl_time_point_s, nanoseconds) - 0usize];
    ["Offset of field: rcl_time_point_s::clock_type"]
        [::std::mem::offset_of!(rcl_time_point_s, clock_type) - 8usize];
};
impl Default for rcl_time_point_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_time_point_t = rcl_time_point_s;
unsafe extern "C" {
    pub fn rcl_clock_time_started(clock: *mut rcl_clock_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_clock_valid(clock: *mut rcl_clock_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_clock_init(
        clock_type: rcl_clock_type_t,
        clock: *mut rcl_clock_t,
        allocator: *mut rcl_allocator_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_clock_fini(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_ros_clock_init(
        clock: *mut rcl_clock_t,
        allocator: *mut rcl_allocator_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_ros_clock_fini(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_steady_clock_init(
        clock: *mut rcl_clock_t,
        allocator: *mut rcl_allocator_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_steady_clock_fini(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_system_clock_init(
        clock: *mut rcl_clock_t,
        allocator: *mut rcl_allocator_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_system_clock_fini(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_difference_times(
        start: *const rcl_time_point_t,
        finish: *const rcl_time_point_t,
        delta: *mut rcl_duration_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_clock_get_now(
        clock: *mut rcl_clock_t,
        time_point_value: *mut rcl_time_point_value_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_enable_ros_time_override(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_disable_ros_time_override(clock: *mut rcl_clock_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_is_enabled_ros_time_override(
        clock: *mut rcl_clock_t,
        is_enabled: *mut bool,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_set_ros_time_override(
        clock: *mut rcl_clock_t,
        time_value: rcl_time_point_value_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_clock_add_jump_callback(
        clock: *mut rcl_clock_t,
        threshold: rcl_jump_threshold_t,
        callback: rcl_jump_callback_t,
        user_data: *mut ::std::os::raw::c_void,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_clock_remove_jump_callback(
        clock: *mut rcl_clock_t,
        callback: rcl_jump_callback_t,
        user_data: *mut ::std::os::raw::c_void,
    ) -> rcl_ret_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_publisher_impl_s {
    _unused: [u8; 0],
}
pub type rcl_publisher_impl_t = rcl_publisher_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_publisher_s {
    pub impl_: *mut rcl_publisher_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_publisher_s"][::std::mem::size_of::<rcl_publisher_s>() - 8usize];
    ["Alignment of rcl_publisher_s"][::std::mem::align_of::<rcl_publisher_s>() - 8usize];
    ["Offset of field: rcl_publisher_s::impl_"]
        [::std::mem::offset_of!(rcl_publisher_s, impl_) - 0usize];
};
impl Default for rcl_publisher_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_publisher_t = rcl_publisher_s;
#[repr(C)]
pub struct rcl_publisher_options_s {
    pub qos: rmw_qos_profile_t,
    pub allocator: rcl_allocator_t,
    pub rmw_publisher_options: rmw_publisher_options_t,
    pub disable_loaned_message: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_publisher_options_s"]
        [::std::mem::size_of::<rcl_publisher_options_s>() - 152usize];
    ["Alignment of rcl_publisher_options_s"]
        [::std::mem::align_of::<rcl_publisher_options_s>() - 8usize];
    ["Offset of field: rcl_publisher_options_s::qos"]
        [::std::mem::offset_of!(rcl_publisher_options_s, qos) - 0usize];
    ["Offset of field: rcl_publisher_options_s::allocator"]
        [::std::mem::offset_of!(rcl_publisher_options_s, allocator) - 88usize];
    ["Offset of field: rcl_publisher_options_s::rmw_publisher_options"]
        [::std::mem::offset_of!(rcl_publisher_options_s, rmw_publisher_options) - 128usize];
    ["Offset of field: rcl_publisher_options_s::disable_loaned_message"]
        [::std::mem::offset_of!(rcl_publisher_options_s, disable_loaned_message) - 144usize];
};
impl Default for rcl_publisher_options_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_publisher_options_t = rcl_publisher_options_s;
unsafe extern "C" {
    pub fn rcl_get_zero_initialized_publisher() -> rcl_publisher_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_default_options() -> rcl_publisher_options_t;
}
unsafe extern "C" {
    pub fn rcl_borrow_loaned_message(
        publisher: *const rcl_publisher_t,
        type_support: *const rosidl_message_type_support_t,
        ros_message: *mut *mut ::std::os::raw::c_void,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_return_loaned_message_from_publisher(
        publisher: *const rcl_publisher_t,
        loaned_message: *mut ::std::os::raw::c_void,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_publish_loaned_message(
        publisher: *const rcl_publisher_t,
        ros_message: *mut ::std::os::raw::c_void,
        allocation: *mut rmw_publisher_allocation_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_assert_liveliness(publisher: *const rcl_publisher_t) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_wait_for_all_acked(
        publisher: *const rcl_publisher_t,
        timeout: rcl_duration_value_t,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_topic_name(
        publisher: *const rcl_publisher_t,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_options(
        publisher: *const rcl_publisher_t,
    ) -> *const rcl_publisher_options_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_rmw_handle(publisher: *const rcl_publisher_t) -> *mut rmw_publisher_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_context(publisher: *const rcl_publisher_t) -> *mut rcl_context_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_is_valid(publisher: *const rcl_publisher_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_publisher_is_valid_except_context(publisher: *const rcl_publisher_t) -> bool;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_subscription_count(
        publisher: *const rcl_publisher_t,
        subscription_count: *mut usize,
    ) -> rcl_ret_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_get_actual_qos(
        publisher: *const rcl_publisher_t,
    ) -> *const rmw_qos_profile_t;
}
unsafe extern "C" {
    pub fn rcl_publisher_can_loan_messages(publisher: *const rcl_publisher_t) -> bool;
}
pub type rmw_event_callback_t = ::std::option::Option<
    unsafe extern "C" fn(user_data: *const ::std::os::raw::c_void, number_of_events: usize),
>;
pub type rcl_event_callback_t = rmw_event_callback_t;
pub type rosidl_dynamic_typesupport_member_id_t = usize;
pub type rosidl_dynamic_typesupport_serialization_support_t =
    rosidl_dynamic_typesupport_serialization_support_s;
pub type rosidl_dynamic_typesupport_serialization_support_impl_t =
    rosidl_dynamic_typesupport_serialization_support_impl_s;
pub type rosidl_dynamic_typesupport_serialization_support_interface_t =
    rosidl_dynamic_typesupport_serialization_support_interface_s;
pub type rosidl_dynamic_typesupport_dynamic_type_builder_impl_t =
    rosidl_dynamic_typesupport_dynamic_type_builder_impl_s;
pub type rosidl_dynamic_typesupport_dynamic_type_impl_t =
    rosidl_dynamic_typesupport_dynamic_type_impl_s;
pub type rosidl_dynamic_typesupport_dynamic_data_t = rosidl_dynamic_typesupport_dynamic_data_s;
pub type rosidl_dynamic_typesupport_dynamic_data_impl_t =
    rosidl_dynamic_typesupport_dynamic_data_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_serialization_support_interface_s {
    pub allocator: rcutils_allocator_t,
    pub serialization_library_identifier: *const ::std::os::raw::c_char,
    pub serialization_support_impl_fini: ::std::option::Option<
        unsafe extern "C" fn(
            impl_: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub serialization_support_interface_fini: ::std::option::Option<
        unsafe extern "C" fn(
            methods: *mut rosidl_dynamic_typesupport_serialization_support_interface_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_equals: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            type_: *const rosidl_dynamic_typesupport_dynamic_type_impl_t,
            other: *const rosidl_dynamic_typesupport_dynamic_type_impl_t,
            equals: *mut bool,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_get_member_count: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type: *const rosidl_dynamic_typesupport_dynamic_type_impl_t,
            member_count: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_init: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            allocator: *mut rcutils_allocator_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_clone: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            other: *const rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_fini: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_init_from_dynamic_type_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_type: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_clone: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            other: *const rosidl_dynamic_typesupport_dynamic_type_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_type: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_fini: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_get_name: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type: *const rosidl_dynamic_typesupport_dynamic_type_impl_t,
            name: *mut *const ::std::os::raw::c_char,
            name_length: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_get_name: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *const rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            name: *mut *const ::std::os::raw::c_char,
            name_length: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_set_name: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bool_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_byte_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_char_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wchar_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float32_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float64_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float128_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int8_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint8_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int16_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint16_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int32_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint32_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int64_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint64_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_string_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wstring_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_string_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_wstring_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_string_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_wstring_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bool_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_byte_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_char_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wchar_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float32_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float64_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float128_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int8_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint8_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int16_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint16_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int32_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint32_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int64_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint64_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_string_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wstring_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_string_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_wstring_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_length: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_string_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_bound: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_wstring_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_bound: usize,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bool_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_byte_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_char_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wchar_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float32_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float64_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float128_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int8_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint8_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int16_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint16_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int32_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint32_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int64_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint64_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_string_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wstring_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_string_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_wstring_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_string_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_wstring_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bool_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_byte_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_char_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wchar_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float32_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float64_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_float128_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int8_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint8_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int16_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint16_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int32_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint32_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_int64_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_uint64_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_string_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_wstring_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_string_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_fixed_wstring_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_length: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_string_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            string_bound: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_bounded_wstring_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            wstring_bound: usize,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_array_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_unbounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_bounded_sequence_member: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_member_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_array_member_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            array_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_unbounded_sequence_member_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_type_builder_add_complex_bounded_sequence_member_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            default_value: *const ::std::os::raw::c_char,
            default_value_length: usize,
            nested_struct_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            sequence_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_clear_all_values: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_clear_nonkey_values: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_clear_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_equals: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            other: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            equals: *mut bool,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_item_count: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            item_count: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_member_id_by_name: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            name: *const ::std::os::raw::c_char,
            name_length: usize,
            member_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_member_id_at_index: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            index: usize,
            member_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_array_index: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            index: usize,
            array_index: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_loan_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            allocator: *mut rcutils_allocator_t,
            loaned_dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_return_loaned_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            inner_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_name: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            name: *mut *const ::std::os::raw::c_char,
            name_length: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_init_from_dynamic_type_builder: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_type_builder: *mut rosidl_dynamic_typesupport_dynamic_type_builder_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_init_from_dynamic_type: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            type_: *mut rosidl_dynamic_typesupport_dynamic_type_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_clone: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            other: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            allocator: *mut rcutils_allocator_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_fini: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_serialize: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            buffer: *mut rcutils_uint8_array_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_deserialize: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            buffer: *mut rcutils_uint8_array_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_bool_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut bool,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_byte_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_char_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut ::std::os::raw::c_char,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_wchar_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_float32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut f32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_float64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut f64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_float128_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u128,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_int8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut i8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_uint8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_int16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut i16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_uint16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_int32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut i32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_uint32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_int64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut i64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_uint64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut u64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut ::std::os::raw::c_char,
            value_length: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut u16,
            value_length: *mut usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_fixed_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut ::std::os::raw::c_char,
            value_length: *mut usize,
            string_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_fixed_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut u16,
            value_length: *mut usize,
            wstring_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_bounded_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut ::std::os::raw::c_char,
            value_length: *mut usize,
            string_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_bounded_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut *mut u16,
            value_length: *mut usize,
            wstring_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_bool_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: bool,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_byte_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_char_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: ::std::os::raw::c_char,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_wchar_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_float32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: f32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_float64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: f64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_float128_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u128,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_int8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: i8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_uint8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u8,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_int16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: i16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_uint16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u16,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_int32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: i32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_uint32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u32,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_int64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: i64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_uint64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: u64,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const u16,
            value_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_fixed_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
            string_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_fixed_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const u16,
            value_length: usize,
            wstring_length: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_bounded_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
            string_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_bounded_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *const u16,
            value_length: usize,
            wstring_bound: usize,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_clear_sequence_data: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_remove_sequence_data: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_sequence_data: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_bool_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: bool,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_byte_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u8,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_char_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: ::std::os::raw::c_char,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_wchar_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u16,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_float32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: f32,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_float64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: f64,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_float128_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u128,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_int8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: i8,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_uint8_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u8,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_int16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: i16,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_uint16_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u16,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_int32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: i32,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_uint32_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u32,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_int64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: i64,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_uint64_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: u64,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const u16,
            value_length: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_fixed_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
            string_length: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_fixed_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const u16,
            value_length: usize,
            wstring_length: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_bounded_string_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const ::std::os::raw::c_char,
            value_length: usize,
            string_bound: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_bounded_wstring_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const u16,
            value_length: usize,
            wstring_bound: usize,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_get_complex_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            allocator: *mut rcutils_allocator_t,
            value: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_set_complex_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            id: rosidl_dynamic_typesupport_member_id_t,
            value: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_complex_value_copy: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *const rosidl_dynamic_typesupport_dynamic_data_impl_t,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
    pub dynamic_data_insert_complex_value: ::std::option::Option<
        unsafe extern "C" fn(
            serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_impl_t,
            dynamic_data: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            value: *mut rosidl_dynamic_typesupport_dynamic_data_impl_t,
            out_id: *mut rosidl_dynamic_typesupport_member_id_t,
        ) -> rcutils_ret_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_serialization_support_interface_s"][::std::mem::size_of::<
        rosidl_dynamic_typesupport_serialization_support_interface_s,
    >() - 1584usize];
    ["Alignment of rosidl_dynamic_typesupport_serialization_support_interface_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_serialization_support_interface_s>()
            - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        allocator
    )
        - 0usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::serialization_library_identifier",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        serialization_library_identifier
    ) - 40usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::serialization_support_impl_fini",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        serialization_support_impl_fini
    ) - 48usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::serialization_support_interface_fini",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        serialization_support_interface_fini
    ) - 56usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_equals",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_equals
    ) - 64usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_get_member_count",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_get_member_count
    ) - 72usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_init",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_init
    ) - 80usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_clone",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_clone
    ) - 88usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_fini",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_fini
    ) - 96usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_init_from_dynamic_type_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_init_from_dynamic_type_builder
    ) - 104usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_clone",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_clone
    ) - 112usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_fini",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_fini
    ) - 120usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_get_name",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_get_name
    ) - 128usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_get_name",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_get_name
    ) - 136usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_set_name",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_set_name
    ) - 144usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bool_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bool_member
    ) - 152usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_byte_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_byte_member
    ) - 160usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_char_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_char_member
    ) - 168usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wchar_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wchar_member
    ) - 176usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float32_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float32_member
    ) - 184usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float64_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float64_member
    ) - 192usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float128_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float128_member
    ) - 200usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int8_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int8_member
    ) - 208usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint8_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint8_member
    ) - 216usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int16_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int16_member
    ) - 224usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint16_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint16_member
    ) - 232usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int32_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int32_member
    ) - 240usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint32_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint32_member
    ) - 248usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int64_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int64_member
    ) - 256usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint64_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint64_member
    ) - 264usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_string_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_string_member
    ) - 272usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wstring_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wstring_member
    ) - 280usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_string_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_string_member
    ) - 288usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_wstring_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_wstring_member
    ) - 296usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_string_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_string_member
    ) - 304usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_wstring_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_wstring_member
    ) - 312usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bool_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bool_array_member
    ) - 320usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_byte_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_byte_array_member
    ) - 328usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_char_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_char_array_member
    ) - 336usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wchar_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wchar_array_member
    ) - 344usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float32_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float32_array_member
    ) - 352usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float64_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float64_array_member
    ) - 360usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float128_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float128_array_member
    ) - 368usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int8_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int8_array_member
    ) - 376usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint8_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint8_array_member
    ) - 384usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int16_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int16_array_member
    ) - 392usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint16_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint16_array_member
    ) - 400usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int32_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int32_array_member
    ) - 408usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint32_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint32_array_member
    ) - 416usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int64_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int64_array_member
    ) - 424usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint64_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint64_array_member
    ) - 432usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_string_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_string_array_member
    ) - 440usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wstring_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wstring_array_member
    ) - 448usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_string_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_string_array_member
    ) - 456usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_wstring_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_wstring_array_member
    ) - 464usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_string_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_string_array_member
    ) - 472usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_wstring_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_wstring_array_member
    ) - 480usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bool_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bool_unbounded_sequence_member
    ) - 488usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_byte_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_byte_unbounded_sequence_member
    ) - 496usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_char_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_char_unbounded_sequence_member
    ) - 504usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wchar_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wchar_unbounded_sequence_member
    ) - 512usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float32_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float32_unbounded_sequence_member
    ) - 520usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float64_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float64_unbounded_sequence_member
    ) - 528usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float128_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float128_unbounded_sequence_member
    ) - 536usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int8_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int8_unbounded_sequence_member
    ) - 544usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint8_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint8_unbounded_sequence_member
    ) - 552usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int16_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int16_unbounded_sequence_member
    ) - 560usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint16_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint16_unbounded_sequence_member
    ) - 568usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int32_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int32_unbounded_sequence_member
    ) - 576usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint32_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint32_unbounded_sequence_member
    ) - 584usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int64_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int64_unbounded_sequence_member
    ) - 592usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint64_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint64_unbounded_sequence_member
    ) - 600usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_string_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_string_unbounded_sequence_member
    ) - 608usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wstring_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wstring_unbounded_sequence_member
    ) - 616usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_string_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_string_unbounded_sequence_member
    ) - 624usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_wstring_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_wstring_unbounded_sequence_member
    ) - 632usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_string_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_string_unbounded_sequence_member
    ) - 640usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_wstring_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_wstring_unbounded_sequence_member
    ) - 648usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bool_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bool_bounded_sequence_member
    ) - 656usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_byte_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_byte_bounded_sequence_member
    ) - 664usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_char_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_char_bounded_sequence_member
    ) - 672usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wchar_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wchar_bounded_sequence_member
    ) - 680usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float32_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float32_bounded_sequence_member
    ) - 688usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float64_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float64_bounded_sequence_member
    ) - 696usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_float128_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_float128_bounded_sequence_member
    ) - 704usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int8_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int8_bounded_sequence_member
    ) - 712usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint8_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint8_bounded_sequence_member
    ) - 720usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int16_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int16_bounded_sequence_member
    ) - 728usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint16_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint16_bounded_sequence_member
    ) - 736usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int32_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int32_bounded_sequence_member
    ) - 744usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint32_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint32_bounded_sequence_member
    ) - 752usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_int64_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_int64_bounded_sequence_member
    ) - 760usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_uint64_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_uint64_bounded_sequence_member
    ) - 768usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_string_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_string_bounded_sequence_member
    ) - 776usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_wstring_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_wstring_bounded_sequence_member
    ) - 784usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_string_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_string_bounded_sequence_member
    ) - 792usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_fixed_wstring_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_fixed_wstring_bounded_sequence_member
    ) - 800usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_string_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_string_bounded_sequence_member
    ) - 808usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_bounded_wstring_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_bounded_wstring_bounded_sequence_member
    ) - 816usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_member
    ) - 824usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_array_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_array_member
    ) - 832usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_unbounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_unbounded_sequence_member
    ) - 840usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_bounded_sequence_member",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_bounded_sequence_member
    ) - 848usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_member_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_member_builder
    ) - 856usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_array_member_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_array_member_builder
    ) - 864usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_unbounded_sequence_member_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_unbounded_sequence_member_builder
    ) - 872usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_type_builder_add_complex_bounded_sequence_member_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_type_builder_add_complex_bounded_sequence_member_builder
    ) - 880usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_clear_all_values",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_clear_all_values
    ) - 888usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_clear_nonkey_values",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_clear_nonkey_values
    ) - 896usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_clear_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_clear_value
    ) - 904usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_equals",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_equals
    ) - 912usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_item_count",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_item_count
    ) - 920usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_member_id_by_name",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_member_id_by_name
    ) - 928usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_member_id_at_index",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_member_id_at_index
    ) - 936usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_array_index",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_array_index
    ) - 944usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_loan_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_loan_value
    ) - 952usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_return_loaned_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_return_loaned_value
    ) - 960usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_name",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_name
    ) - 968usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_init_from_dynamic_type_builder",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_init_from_dynamic_type_builder
    ) - 976usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_init_from_dynamic_type",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_init_from_dynamic_type
    ) - 984usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_clone",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_clone
    ) - 992usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_fini",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_fini
    ) - 1000usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_serialize",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_serialize
    ) - 1008usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_deserialize",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_deserialize
    ) - 1016usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_bool_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_bool_value
    ) - 1024usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_byte_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_byte_value
    ) - 1032usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_char_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_char_value
    ) - 1040usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_wchar_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_wchar_value
    ) - 1048usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_float32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_float32_value
    ) - 1056usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_float64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_float64_value
    ) - 1064usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_float128_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_float128_value
    ) - 1072usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_int8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_int8_value
    ) - 1080usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_uint8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_uint8_value
    ) - 1088usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_int16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_int16_value
    ) - 1096usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_uint16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_uint16_value
    ) - 1104usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_int32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_int32_value
    ) - 1112usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_uint32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_uint32_value
    ) - 1120usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_int64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_int64_value
    ) - 1128usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_uint64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_uint64_value
    ) - 1136usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_string_value
    ) - 1144usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_wstring_value
    ) - 1152usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_fixed_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_fixed_string_value
    ) - 1160usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_fixed_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_fixed_wstring_value
    ) - 1168usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_bounded_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_bounded_string_value
    ) - 1176usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_bounded_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_bounded_wstring_value
    ) - 1184usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_bool_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_bool_value
    ) - 1192usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_byte_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_byte_value
    ) - 1200usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_char_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_char_value
    ) - 1208usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_wchar_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_wchar_value
    ) - 1216usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_float32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_float32_value
    ) - 1224usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_float64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_float64_value
    ) - 1232usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_float128_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_float128_value
    ) - 1240usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_int8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_int8_value
    ) - 1248usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_uint8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_uint8_value
    ) - 1256usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_int16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_int16_value
    ) - 1264usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_uint16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_uint16_value
    ) - 1272usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_int32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_int32_value
    ) - 1280usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_uint32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_uint32_value
    ) - 1288usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_int64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_int64_value
    ) - 1296usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_uint64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_uint64_value
    ) - 1304usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_string_value
    ) - 1312usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_wstring_value
    ) - 1320usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_fixed_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_fixed_string_value
    ) - 1328usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_fixed_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_fixed_wstring_value
    ) - 1336usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_bounded_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_bounded_string_value
    ) - 1344usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_bounded_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_bounded_wstring_value
    ) - 1352usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_clear_sequence_data",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_clear_sequence_data
    ) - 1360usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_remove_sequence_data",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_remove_sequence_data
    ) - 1368usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_sequence_data",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_sequence_data
    ) - 1376usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_bool_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_bool_value
    ) - 1384usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_byte_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_byte_value
    ) - 1392usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_char_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_char_value
    ) - 1400usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_wchar_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_wchar_value
    ) - 1408usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_float32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_float32_value
    ) - 1416usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_float64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_float64_value
    ) - 1424usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_float128_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_float128_value
    ) - 1432usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_int8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_int8_value
    ) - 1440usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_uint8_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_uint8_value
    ) - 1448usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_int16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_int16_value
    ) - 1456usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_uint16_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_uint16_value
    ) - 1464usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_int32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_int32_value
    ) - 1472usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_uint32_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_uint32_value
    ) - 1480usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_int64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_int64_value
    ) - 1488usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_uint64_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_uint64_value
    ) - 1496usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_string_value
    ) - 1504usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_wstring_value
    ) - 1512usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_fixed_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_fixed_string_value
    ) - 1520usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_fixed_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_fixed_wstring_value
    ) - 1528usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_bounded_string_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_bounded_string_value
    ) - 1536usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_bounded_wstring_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_bounded_wstring_value
    ) - 1544usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_get_complex_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_get_complex_value
    ) - 1552usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_set_complex_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_set_complex_value
    ) - 1560usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_complex_value_copy",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_complex_value_copy
    ) - 1568usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_interface_s::dynamic_data_insert_complex_value",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_interface_s,
        dynamic_data_insert_complex_value
    ) - 1576usize];
};
impl Default for rosidl_dynamic_typesupport_serialization_support_interface_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_dynamic_data_impl_s {
    pub allocator: rcutils_allocator_t,
    pub handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_dynamic_data_impl_s"]
        [::std::mem::size_of::<rosidl_dynamic_typesupport_dynamic_data_impl_s>() - 48usize];
    ["Alignment of rosidl_dynamic_typesupport_dynamic_data_impl_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_dynamic_data_impl_s>() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_data_impl_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_dynamic_data_impl_s,
        allocator
    ) - 0usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_data_impl_s::handle"]
        [::std::mem::offset_of!(rosidl_dynamic_typesupport_dynamic_data_impl_s, handle) - 40usize];
};
impl Default for rosidl_dynamic_typesupport_dynamic_data_impl_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_dynamic_data_s {
    pub allocator: rcutils_allocator_t,
    pub impl_: rosidl_dynamic_typesupport_dynamic_data_impl_t,
    pub serialization_support: *mut rosidl_dynamic_typesupport_serialization_support_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_dynamic_data_s"]
        [::std::mem::size_of::<rosidl_dynamic_typesupport_dynamic_data_s>() - 96usize];
    ["Alignment of rosidl_dynamic_typesupport_dynamic_data_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_dynamic_data_s>() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_data_s::allocator"]
        [::std::mem::offset_of!(rosidl_dynamic_typesupport_dynamic_data_s, allocator) - 0usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_data_s::impl_"]
        [::std::mem::offset_of!(rosidl_dynamic_typesupport_dynamic_data_s, impl_) - 40usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_data_s::serialization_support"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_dynamic_data_s,
        serialization_support
    )
        - 88usize];
};
impl Default for rosidl_dynamic_typesupport_dynamic_data_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_dynamic_type_builder_impl_s {
    pub allocator: rcutils_allocator_t,
    pub handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_dynamic_type_builder_impl_s"]
        [::std::mem::size_of::<rosidl_dynamic_typesupport_dynamic_type_builder_impl_s>() - 48usize];
    ["Alignment of rosidl_dynamic_typesupport_dynamic_type_builder_impl_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_dynamic_type_builder_impl_s>() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_type_builder_impl_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_dynamic_type_builder_impl_s,
        allocator
    )
        - 0usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_type_builder_impl_s::handle"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_dynamic_type_builder_impl_s,
        handle
    )
        - 40usize];
};
impl Default for rosidl_dynamic_typesupport_dynamic_type_builder_impl_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_dynamic_type_impl_s {
    pub allocator: rcutils_allocator_t,
    pub handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_dynamic_type_impl_s"]
        [::std::mem::size_of::<rosidl_dynamic_typesupport_dynamic_type_impl_s>() - 48usize];
    ["Alignment of rosidl_dynamic_typesupport_dynamic_type_impl_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_dynamic_type_impl_s>() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_type_impl_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_dynamic_type_impl_s,
        allocator
    ) - 0usize];
    ["Offset of field: rosidl_dynamic_typesupport_dynamic_type_impl_s::handle"]
        [::std::mem::offset_of!(rosidl_dynamic_typesupport_dynamic_type_impl_s, handle) - 40usize];
};
impl Default for rosidl_dynamic_typesupport_dynamic_type_impl_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_serialization_support_impl_s {
    pub allocator: rcutils_allocator_t,
    pub serialization_library_identifier: *const ::std::os::raw::c_char,
    pub handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_serialization_support_impl_s"][::std::mem::size_of::<
        rosidl_dynamic_typesupport_serialization_support_impl_s,
    >() - 56usize];
    ["Alignment of rosidl_dynamic_typesupport_serialization_support_impl_s"][::std::mem::align_of::<
        rosidl_dynamic_typesupport_serialization_support_impl_s,
    >() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_impl_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_impl_s,
        allocator
    )
        - 0usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_impl_s::serialization_library_identifier",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_impl_s,
        serialization_library_identifier
    ) - 40usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_impl_s::handle"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_impl_s,
        handle
    )
        - 48usize];
};
impl Default for rosidl_dynamic_typesupport_serialization_support_impl_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rosidl_dynamic_typesupport_serialization_support_s {
    pub allocator: rcutils_allocator_t,
    pub serialization_library_identifier: *const ::std::os::raw::c_char,
    pub impl_: rosidl_dynamic_typesupport_serialization_support_impl_t,
    pub methods: rosidl_dynamic_typesupport_serialization_support_interface_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_dynamic_typesupport_serialization_support_s"]
        [::std::mem::size_of::<rosidl_dynamic_typesupport_serialization_support_s>() - 1688usize];
    ["Alignment of rosidl_dynamic_typesupport_serialization_support_s"]
        [::std::mem::align_of::<rosidl_dynamic_typesupport_serialization_support_s>() - 8usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_s::allocator"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_s,
        allocator
    ) - 0usize];
    [
        "Offset of field: rosidl_dynamic_typesupport_serialization_support_s::serialization_library_identifier",
    ][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_s,
        serialization_library_identifier
    ) - 40usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_s::impl_"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_s,
        impl_
    ) - 48usize];
    ["Offset of field: rosidl_dynamic_typesupport_serialization_support_s::methods"][::std::mem::offset_of!(
        rosidl_dynamic_typesupport_serialization_support_s,
        methods
    ) - 104usize];
};
impl Default for rosidl_dynamic_typesupport_serialization_support_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_message_sequence_s {
    pub data: *mut *mut ::std::os::raw::c_void,
    pub size: usize,
    pub capacity: usize,
    pub allocator: *mut rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_message_sequence_s"][::std::mem::size_of::<rmw_message_sequence_s>() - 32usize];
    ["Alignment of rmw_message_sequence_s"]
        [::std::mem::align_of::<rmw_message_sequence_s>() - 8usize];
    ["Offset of field: rmw_message_sequence_s::data"]
        [::std::mem::offset_of!(rmw_message_sequence_s, data) - 0usize];
    ["Offset of field: rmw_message_sequence_s::size"]
        [::std::mem::offset_of!(rmw_message_sequence_s, size) - 8usize];
    ["Offset of field: rmw_message_sequence_s::capacity"]
        [::std::mem::offset_of!(rmw_message_sequence_s, capacity) - 16usize];
    ["Offset of field: rmw_message_sequence_s::allocator"]
        [::std::mem::offset_of!(rmw_message_sequence_s, allocator) - 24usize];
};
impl Default for rmw_message_sequence_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_message_sequence_t = rmw_message_sequence_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rmw_message_info_sequence_s {
    pub data: *mut rmw_message_info_t,
    pub size: usize,
    pub capacity: usize,
    pub allocator: *mut rcutils_allocator_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rmw_message_info_sequence_s"]
        [::std::mem::size_of::<rmw_message_info_sequence_s>() - 32usize];
    ["Alignment of rmw_message_info_sequence_s"]
        [::std::mem::align_of::<rmw_message_info_sequence_s>() - 8usize];
    ["Offset of field: rmw_message_info_sequence_s::data"]
        [::std::mem::offset_of!(rmw_message_info_sequence_s, data) - 0usize];
    ["Offset of field: rmw_message_info_sequence_s::size"]
        [::std::mem::offset_of!(rmw_message_info_sequence_s, size) - 8usize];
    ["Offset of field: rmw_message_info_sequence_s::capacity"]
        [::std::mem::offset_of!(rmw_message_info_sequence_s, capacity) - 16usize];
    ["Offset of field: rmw_message_info_sequence_s::allocator"]
        [::std::mem::offset_of!(rmw_message_info_sequence_s, allocator) - 24usize];
};
impl Default for rmw_message_info_sequence_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rmw_message_info_sequence_t = rmw_message_info_sequence_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rcl_subscription_impl_s {
    _unused: [u8; 0],
}
pub type rcl_subscription_impl_t = rcl_subscription_impl_s;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct rcl_subscription_s {
    pub impl_: *mut rcl_subscription_impl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_subscription_s"][::std::mem::size_of::<rcl_subscription_s>() - 8usize];
    ["Alignment of rcl_subscription_s"][::std::mem::align_of::<rcl_subscription_s>() - 8usize];
    ["Offset of field: rcl_subscription_s::impl_"]
        [::std::mem::offset_of!(rcl_subscription_s, impl_) - 0usize];
};
impl Default for rcl_subscription_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rcl_subscription_t = rcl_subscription_s;
#[repr(C)]
pub struct rcl_subscription_options_s {
    pub qos: rmw_qos_profile_t,
    pub allocator: rcl_allocator_t,
    pub rmw_subscription_options: rmw_subscription_options_t,
    pub disable_loaned_message: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rcl_subscription_options_s"]
        [::std::mem::size_of::<rcl_subscription_options_s>() - 160usize];
    ["Alignment of rcl_subscription_options_s"]
        [::std::mem::align_of::<rcl_subscription_options_s>() - 8usize];
    ["Offset of field: rcl_subscription_options_s::qos"]
        [::std::mem::offset_of!(rcl_subscription_options_s, qos) - 0usize];
    ["Offset of field: rcl_subscription_options_s::allocator"]
